PE5PVB/TEF6686_ESP32/TEF6686_ESP32.ino.cpp
TFT_eSprite FrequencySprite = TFT_eSprite(&tft);
TFT_eSprite RDSSprite = TFT_eSprite(&tft);
TFT_eSprite SquelchSprite = TFT_eSprite(&tft);
TFT_eSprite FullLineSprite = TFT_eSprite(&tft);
TFT_eSprite OneBigLineSprite = TFT_eSprite(&tft);
TFT_eSprite SignalSprite = TFT_eSprite(&tft);
TFT_eSprite PSSprite = TFT_eSprite(&tft);

WiFiConnect wc;
WiFiServer Server(7373);
WiFiClient RemoteClient;
WiFiUDP Udp;
WebServer webserver(80);
void setup();
void loop();
void GetData();
void WakeToSleep(bool yes);
void CheckBandForbiddenFM ();
void doBandSelectionFM();
void CheckBandForbiddenAM();
void doBandSelectionAM();
void AMjumptoFM();
void FMjumptoAM();
void ToggleBand(byte nowBand);
void BANDBUTTONPress();
void StoreFrequency();
void LimitAMFrequency();
void DivdeSWMIBand();
void ToggleSWMIBand(bool frequencyup);
void SelectBand();
void BWButtonPress();
void doStereoToggle();
void ModeButtonPress();
void ShowStepSize();
void Round30K(unsigned int freq);
void Round50K(unsigned int freq);
void Round100K(unsigned int freq);
void Round200K(unsigned int freq);
void Round5K(unsigned int freqAM);
void RoundStep();
void ButtonPress();
void KeyUp();
void KeyDown();
bool IsStationEmpty();
bool IsFrequencyUsed(unsigned int freq);
void ShowMemoryPos();
void DoMemoryPosTune();
void ShowFreq(int mode);
void ShowSignalLevel();
void ShowRDSLogo(bool RDSstatus);
void ShowStereoStatus();
void ShowOffset();
void ShowBW();
void ShowModLevel();
void showAutoSquelch(bool mode);
void doSquelch();
void updateBW();
void updateiMS();
void updateEQ();
void updateCodetect();
void updateSWMIBand();
void doBW();
void doBWtuneDown();
void doBWtuneUp();
void doTuneMode();
void ShowTuneMode();
void ShowRSSI();
void ShowBattery();
void DataPrint(String string);
void TuneUp();
void TuneDown();
void EdgeBeeper();
void Seek(bool mode);
void SetTunerPatch();
void read_encoder();
void MuteScreen(bool setting);
void DefaultSettings();
void tftReplace(int8_t offset, const String & textold, const String & text, int16_t x, int16_t y, int color, int smoothcolor, int background, uint8_t fontsize);
void tftPrint(int8_t offset, const String & text, int16_t x, int16_t y, int color, int smoothcolor, uint8_t fontsize);
void deepSleep();
void UpdateFonts(byte mode);
void cancelDXScan();
void endMenu();
void startFMDXScan();
void rabbitearssend ();
void setAutoSpeedSPI();
uint8_t doAutoMemory(uint16_t startfreq, uint16_t stopfreq, uint8_t startmem, uint8_t stopmem, bool rdsonly, uint8_t doublepi);
void doBandToggle();
void StoreMemoryPos(uint8_t _pos);
void ClearMemoryRange(uint8_t start, uint8_t stop);
void Touch_IRQ_Handler();
int GetNum(void);
void ShowNum(int val);
bool TuneFreq(int temp);
void NumpadProcess(int num);
void toggleiMSEQ();
void doLog();
HSV RGB565toHSV(uint16_t color);
uint16_t HSVtoRGB565(float h, float s, float v);
const char* textUI(uint16_t number);
#line 488 "C:/Users/sverhoeven/OneDrive - Entropia Critical Concepts nv/Documenten/GitHub/TEF6686_ESP32/TEF6686_ESP32.ino"
void setup() {
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);
  gpio_set_drive_capability((gpio_num_t) 5, GPIO_DRIVE_CAP_0);
  gpio_set_drive_capability((gpio_num_t) 16, GPIO_DRIVE_CAP_0);
  gpio_set_drive_capability((gpio_num_t) 17, GPIO_DRIVE_CAP_0);
  gpio_set_drive_capability((gpio_num_t) 18, GPIO_DRIVE_CAP_0);
  gpio_set_drive_capability((gpio_num_t) 19, GPIO_DRIVE_CAP_0);
  gpio_set_drive_capability((gpio_num_t) 21, GPIO_DRIVE_CAP_0);
  gpio_set_drive_capability((gpio_num_t) 22, GPIO_DRIVE_CAP_0);
  gpio_set_drive_capability((gpio_num_t) 23, GPIO_DRIVE_CAP_0);

  setupmode = true;
  EEPROM.begin(EE_TOTAL_CNT);
  if (EEPROM.readByte(EE_BYTE_CHECKBYTE) != EE_CHECKBYTE_VALUE) DefaultSettings();

  frequency = EEPROM.readUInt(EE_UINT16_FREQUENCY_FM);
  frequency_OIRT = EEPROM.readUInt(EE_UINT16_FREQUENCY_OIRT);
  VolSet = EEPROM.readByte(EE_BYTE_VOLSET);
  ConverterSet = EEPROM.readUInt(EE_UINT16_CONVERTERSET);
  LowEdgeSet = EEPROM.readUInt(EE_UINT16_FMLOWEDGESET);
  HighEdgeSet = EEPROM.readUInt(EE_UINT16_FMHIGHEDGESET);
  ContrastSet = EEPROM.readByte(EE_BYTE_CONTRASTSET);
  StereoLevel = EEPROM.readByte(EE_BYTE_STEREOLEVEL);
  bandFM = EEPROM.readByte(EE_BYTE_BANDFM);
  bandAM = EEPROM.readByte(EE_BYTE_BANDAM);
  HighCutLevel = EEPROM.readByte(EE_BYTE_HIGHCUTLEVEL);
  HighCutOffset = EEPROM.readByte(EE_BYTE_HIGHCUTOFFSET);
  LevelOffset = EEPROM.readByte(EE_BYTE_LEVELOFFSET);
  radio.rds.rtbuffer = EEPROM.readByte(EE_BYTE_RTBUFFER);
  edgebeep = EEPROM.readByte(EE_BYTE_EDGEBEEP);
  softmuteam = EEPROM.readByte(EE_BYTE_SOFTMUTEAM);
  softmutefm = EEPROM.readByte(EE_BYTE_SOFTMUTEFM);
  frequency_AM = EEPROM.readUInt(EE_UINT16_FREQUENCY_AM);
  language = EEPROM.readByte(EE_BYTE_LANGUAGE);
  showrdserrors = EEPROM.readByte(EE_BYTE_SHOWRDSERRORS);
  TEF = EEPROM.readByte(EE_BYTE_TEF);
  displayflip = EEPROM.readByte(EE_BYTE_DISPLAYFLIP);
  rotarymode = EEPROM.readByte(EE_BYTE_ROTARYMODE);
  tunemode = EEPROM.readByte(EE_BYTE_TUNEMODE);
  if (tunemode == TUNE_MAN) stepsize = EEPROM.readByte(EE_BYTE_STEPSIZE); else stepsize = 0;
  optenc = EEPROM.readByte(EE_BYTE_OPTENC);
  iMSset = EEPROM.readByte(EE_BYTE_IMSSET);
  EQset = EEPROM.readByte(EE_BYTE_EQSET);
  band = EEPROM.readByte(EE_BYTE_BAND);
  LowLevelSet = EEPROM.readByte(EE_BYTE_LOWLEVELSET);
  memorypos = EEPROM.readByte(EE_BYTE_MEMORYPOS);
  radio.rds.region = EEPROM.readByte(EE_BYTE_REGION);
  radio.underscore = EEPROM.readByte(EE_BYTE_RDS_UNDERSCORE);
  USBmode = EEPROM.readByte(EE_BYTE_USBMODE);
  wifi = EEPROM.readByte(EE_BYTE_WIFI);
  subnetclient = EEPROM.readByte(EE_BYTE_SUBNETCLIENT);
  showSWMIBand = EEPROM.readByte(EE_BYTE_SHOWSWMIBAND);
  radio.rds.filter = EEPROM.readByte(EE_BYTE_RDS_FILTER);
  radio.rds.pierrors = EEPROM.readByte(EE_BYTE_RDS_PIERRORS);
  frequency_LW = EEPROM.readUInt(EE_UINT16_FREQUENCY_LW);
  frequency_MW = EEPROM.readUInt(EE_UINT16_FREQUENCY_MW);
  frequency_SW = EEPROM.readUInt(EE_UINT16_FREQUENCY_SW);
#ifdef HAS_AIR_BAND
  frequency_AIR = EEPROM.readUInt(EE_UINT16_FREQUENCY_AIR);
#endif
  XDRGTK_key = EEPROM.readString(EE_STRING_XDRGTK_KEY);
  RabbitearsUser = EEPROM.readString(EE_STRING_RABBITEARSUSER);
  RabbitearsPassword = EEPROM.readString(EE_STRING_RABBITEARSPASSWORD);
  usesquelch = EEPROM.readByte(EE_BYTE_USESQUELCH);
  showmodulation = EEPROM.readByte(EE_BYTE_SHOWMODULATION);
  amnb = EEPROM.readByte(EE_BYTE_AM_NB);
  fmnb = EEPROM.readByte(EE_BYTE_FM_NB);
  audiomode = EEPROM.readByte(EE_BYTE_AUDIOMODE);
  touchrotating = EEPROM.readByte(EE_BYTE_TOUCH_ROTATING);
  hardwaremodel = EEPROM.readByte(EE_BYTE_HARDWARE_MODEL);
  poweroptions = EEPROM.readByte(EE_BYTE_POWEROPTIONS);
  CurrentTheme = EEPROM.readByte(EE_BYTE_CURRENTTHEME);
  fmdefaultstepsize = EEPROM.readByte(EE_BYTE_FMDEFAULTSTEPSIZE);
  screensaverset = EEPROM.readByte(EE_BYTE_SCREENSAVERSET);
  AMLevelOffset = EEPROM.readInt(EE_INT16_AMLEVELOFFSET);
  unit = EEPROM.readByte(EE_BYTE_UNIT);
  af = EEPROM.readByte(EE_BYTE_AF);
  if (af == 2) radio.rds.afreg = true; else radio.rds.afreg = false;
  StereoToggle = EEPROM.readByte(EE_BYTE_STEREO);
  batteryoptions = EEPROM.readByte(EE_BYTE_BATTERY_OPTIONS);
  amcodect = EEPROM.readByte(EE_BYTE_AM_CO_DECT);
  amcodectcount = EEPROM.readByte(EE_BYTE_AM_CO_DECT_COUNT);
  amgain = EEPROM.readByte(EE_BYTE_AM_RF_GAIN);
  radio.rds.sortaf = EEPROM.readByte(EE_BYTE_SORTAF);
  stationlistid = EEPROM.readByte(EE_BYTE_STATIONLISTID);
  fmdeemphasis = EEPROM.readByte(EE_BYTE_FM_DEEMPHASIS);
  BWsetFM = EEPROM.readByte(EE_BYTE_BWSET_FM);
  BWsetAM = EEPROM.readByte(EE_BYTE_BWSET_AM);
  nowToggleSWMIBand = EEPROM.readByte(EE_BYTE_BANDAUTOSW);
  radio.rds.fastps = EEPROM.readByte(EE_BYTE_FASTPS);
  tot = EEPROM.readByte(EE_BYTE_TOT);
  mwstepsize = EEPROM.readByte(EE_BYTE_MWREGION);
#ifdef HAS_AIR_BAND
  airstepsize = EEPROM.readByte(EE_BYTE_AIRSTEPSIZE);
#endif
  spispeed = EEPROM.readByte(EE_BYTE_SPISPEED);
  amscansens = EEPROM.readByte(EE_BYTE_AMSCANSENS);
  fmscansens = EEPROM.readByte(EE_BYTE_FMSCANSENS);
  freqfont = EEPROM.readByte(EE_BYTE_FREQFONT);
  CurrentSkin = EEPROM.readByte(EE_BYTE_SKIN);
  XDRGTKMuteScreen = EEPROM.readByte(EE_BYTE_XDRGTKMUTE);
  fmagc = EEPROM.readByte(EE_BYTE_FMAGC);
  amagc = EEPROM.readByte(EE_BYTE_AMAGC);
  fmsi = EEPROM.readByte(EE_BYTE_FMSI);
  scanstart = EEPROM.readByte(EE_BYTE_SCANSTART);
  scanstop = EEPROM.readByte(EE_BYTE_SCANSTOP);
  scanhold = EEPROM.readByte(EE_BYTE_SCANHOLD);
  scanmem = EEPROM.readByte(EE_BYTE_SCANMEM);
  scancancel = EEPROM.readByte(EE_BYTE_SCANCANCEL);
  scanmute = EEPROM.readByte(EE_BYTE_SCANMUTE);
  autosquelch = EEPROM.readByte(EE_BYTE_AUTOSQUELCH);
  longbandpress = EEPROM.readByte(EE_BYTE_LONGBANDPRESS);
  showclock = EEPROM.readByte(EE_BYTE_SHOWCLOCK);
  showlongps = EEPROM.readByte(EE_BYTE_SHOWLONGPS);
  memstartfreq = EEPROM.readUInt(EE_UINT16_MEMSTARTFREQ);
  memstopfreq = EEPROM.readUInt(EE_UINT16_MEMSTOPFREQ);
  memstartpos = EEPROM.readByte(EE_BYTE_MEMSTARTPOS);
  memstoppos = EEPROM.readByte(EE_BYTE_MEMSTOPPOS);
  mempionly = EEPROM.readByte(EE_BYTE_MEMPIONLY);
  memdoublepi = EEPROM.readByte(EE_BYTE_MEMDOUBLEPI);
  scanholdonsignal = EEPROM.readByte(EE_BYTE_WAITONLYONSIGNAL);
  TouchCalData[0] = EEPROM.readUInt(EE_UINT16_CALTOUCH1);
  TouchCalData[1] = EEPROM.readUInt(EE_UINT16_CALTOUCH2);
  TouchCalData[2] = EEPROM.readUInt(EE_UINT16_CALTOUCH3);
  TouchCalData[3] = EEPROM.readUInt(EE_UINT16_CALTOUCH4);
  TouchCalData[4] = EEPROM.readUInt(EE_UINT16_CALTOUCH5);
  invertdisplay = EEPROM.readByte(EE_BYTE_INVERTDISPLAY);
  NTPoffset = EEPROM.readByte(EE_BYTE_NTPOFFSET);
  autolog = EEPROM.readByte(EE_BYTE_AUTOLOG);
  autoDST = EEPROM.readByte(EE_BYTE_AUTODST);
  clockampm = EEPROM.readByte(EE_BYTE_CLOCKAMPM);
  logcounter = EEPROM.readUInt(EE_UINT16_LOGCOUNTER);
  radio.rds.PICTlock = EEPROM.readUInt(EE_UINT16_PICTLOCK);

