PE5PVB/TEF6686_ESP32/TEF6686_ESP32.ino.cpp
  tft.fillRect(136, 230, 16, 6, PrimaryColor);

  TEF = EEPROM.readByte(EE_BYTE_TEF);

  if (TEF != 102 && TEF != 205) SetTunerPatch();

  radio.init(TEF);
  uint16_t device;
  uint16_t hw;
  uint16_t sw;

  radio.getIdentification(device, hw, sw);
  if (TEF != (highByte(hw) * 100 + highByte(sw))) SetTunerPatch();

  if (lowByte(device) == 14) {
    fullsearchrds = false;
    fmsi = false;
    chipmodel = 0;
    tft.fillRect(168, 230, 16, 6, PrimaryColor);
    tftPrint(ACENTER, "TEF6686 Lithio", 160, 172, ActiveColor, ActiveColorSmooth, 28);
  } else if (lowByte(device) == 1) {
    fullsearchrds = true;
    chipmodel = 1;
    tft.fillRect(168, 230, 16, 6, PrimaryColor);
    tftPrint(ACENTER, "TEF6687 Lithio FMSI", 160, 172, ActiveColor, ActiveColorSmooth, 28);
  } else if (lowByte(device) == 9) {
    fullsearchrds = false;
    chipmodel = 2;
    fmsi = false;
    tft.fillRect(168, 230, 16, 6, PrimaryColor);
    tftPrint(ACENTER, "TEF6688 Lithio DR", 160, 172, ActiveColor, ActiveColorSmooth, 28);
  } else if (lowByte(device) == 3) {
    fullsearchrds = true;
    chipmodel = 3;
    tft.fillRect(168, 230, 16, 6, PrimaryColor);
    tftPrint(ACENTER, "TEF6689 Lithio FMSI DR", 160, 172, ActiveColor, ActiveColorSmooth, 28);
  } else {
    tftPrint(ACENTER, textUI(9), 160, 172, SignificantColor, SignificantColorSmooth, 28);
    tft.fillRect(168, 230, 16, 6, SignificantColor);
    for (;;);
  }
  tftPrint(ACENTER, "Patch: v" + String(TEF), 160, 202, ActiveColor, ActiveColorSmooth, 28);

  Wire.beginTransmission(0x20);
  Wire.write(0x06);
  Wire.write(0xFF);
  Wire.write(0xFF);
  Wire.endTransmission();


  if (rx8010_init()) {
    struct tm t;
    if (rx8010_getTime(&t)) {
      rtc.setTime(mktime(&t));
      rtcset = true;
    }
  }

  if (analogRead(BATTERY_PIN) < 200) batterydetect = false;
  if (!SPIFFS.exists("/logbook.csv")) handleCreateNewLogbook();

  tryWiFi();
  delay(1500);

  radio.setVolume(VolSet);
  radio.setOffset(LevelOffset);
  radio.setAMOffset(AMLevelOffset);
  if (band > BAND_GAP && band != BAND_AIR) {
    radio.setAMCoChannel(amcodect, amcodectcount);
    radio.setAMAttenuation(amgain);
  }
  radio.setStereoLevel(StereoLevel);
  radio.setHighCutLevel(HighCutLevel);
  radio.setHighCutOffset(HighCutOffset);
  radio.clearRDS(fullsearchrds);
  radio.setMute();
  if (!StereoToggle) radio.setMono(true);
  radio.setSoftmuteFM(softmutefm);
  radio.setSoftmuteAM(softmuteam);
  radio.setAMNoiseBlanker(amnb);
  radio.setFMNoiseBlanker(fmnb);
  radio.setAudio(audiomode);
  radio.setDeemphasis(fmdeemphasis);
  radio.setAGC(fmagc);
  radio.setAMAGC(amagc);
  if (fmsi) radio.setFMSI(2); else radio.setFMSI(1);
  LowLevelInit = true;

  if (ConverterSet >= 200) {
    Wire.beginTransmission(0x12);
    Wire.write(ConverterSet >> 8);
    Wire.write(ConverterSet & (0xFF));
    Wire.endTransmission();
  }

  BuildDisplay();
  SelectBand();
  if (tunemode == TUNE_MEM) DoMemoryPosTune();

  setupmode = false;

  if (edgebeep) radio.tone(50, -5, 2000);
  if (!usesquelch) radio.setUnMute();

  screensavertimer = millis();
  tottimer = millis();
}

void loop() {
  wifiPoll();

  if (wifi && !menu) {
    webserver.handleClient();
    ntpPoll();

    if (remoteip != IPAddress(0, 0, 0, 0) && millis() >= udplogtimer + 500) {
      sendUDPlog();
      udplogtimer = millis();
    }

    if (millis() >= NTPtimer + 1800000) {
      NTPupdate();
      NTPtimer = millis();
    }
  }

  if (hardwaremodel == PORTABLE_TOUCH_ILI9341 && touch_detect) {
    if (tft.getTouchRawZ() > 100) {
      uint16_t x, y;
      tft.getTouch(&x, &y);
      if (x > 0 || y > 0) {
        if (!firstTouchHandled) {

          doTouchEvent(x, y);
          firstTouchHandled = true;
          lastTouchTime = millis();
        } else if (touchrepeat) {

          if (millis() - lastTouchTime >= 500) {

            doTouchEvent(x, y);
          }
        }
      }
    } else {

      firstTouchHandled = false;
      touch_detect = false;
    }
  }

  Communication();

  if (tot != 0) {
    unsigned long totprobe = tot * 60000;
    if (millis() >= tottimer + totprobe) deepSleep();
  }

  if (freq_in != 0 && millis() >= keypadtimer + 3000) {
    freq_in = 0;
    ShowFreq(0);
  }

  if (scandxmode) {
    unsigned long waitTime = (scanhold == 0) ? 500 : (scanhold * 1000);
    if (!scanholdflag) scanholdflag = (USN < fmscansens * 30) && (WAM < 230) && (OStatus < 80) && (OStatus > -80);
    bool bypassMillisCheck = scanholdonsignal && !scanholdflag;
    bool shouldScan = bypassMillisCheck || (!bypassMillisCheck && (millis() >= scantimer + waitTime));

    if (shouldScan) {
      if (scanmute && scanholdonsignal) {
        radio.setMute();
        if (!screenmute) tft.drawBitmap(249, 4, Speaker, 28, 24, PrimaryColor);
        SQ = true;
      }
      scanholdflag = false;
      if (scanmem) {
        memorypos++;
        if (memorypos > scanstop) memorypos = scanstart;
        while (IsStationEmpty() || (presets[memorypos].band != BAND_FM && presets[memorypos].band != BAND_OIRT)) {
          memorypos++;
          if (memorypos > scanstop) {
            memorypos = scanstart;
            break;
          }
        }
        doLog();
        if (memorypos == scanstart) rabbitearssend();
        DoMemoryPosTune();
        radio.clearRDS(fullsearchrds);
        autologged = false;
        ShowMemoryPos();
      } else {
        doLog();
        TuneUp();
        autologged = false;
        ShowFreq(0);
        if (XDRGTKUSB || XDRGTKTCP) DataPrint("T" + String((frequency + ConverterSet * 100) * 10) + "\n");
      }
      scantimer = millis();
      initdxscan = false;
    } else {
      if (scanmute && scanholdonsignal) {
        radio.setUnMute();
        SQ = false;
        if (!screenmute) tft.drawBitmap(249, 4, Speaker, 28, 24, GreyoutColor);
      }
    }

    if (millis() >= flashingtimer + 500) {
      flashing = !flashing;
      if (flashing) {
        tft.fillRoundRect(2, 80, 40, 18, 2, SecondaryColor);
        tftPrint(ACENTER, "MEM", 22, 82, BackgroundColor, SecondaryColor, 16);
      } else {
        tft.fillRoundRect(2, 80, 40, 18, 2, GreyoutColor);
        tftPrint(ACENTER, "MEM", 22, 82, BackgroundColor, GreyoutColor, 16);
      }
      flashingtimer = millis();
    }

    if (!scanholdflag) delay(100);
    radio.getStatus(SStatus, USN, WAM, OStatus, BW, MStatus, CN);

    if (RabbitearsUser.length() && RabbitearsPassword.length() && radio.rds.region != 0 && radio.rds.correctPI != 0 && frequency >= 8810 && frequency <= 10790 && !(frequency % 10) && ((frequency / 10) % 2)) {
      byte i = (frequency / 10 - 881) / 2;
      if (!rabbitearspi[i]) {
        rabbitearspi[i] = radio.rds.correctPI;

        const time_t epoch = rtc.getEpoch() + rtc.offset;
        strftime(rabbitearstime[i], 21, "%FT%TZ", localtime(&epoch));
      }
    }

