PE5PVB/TEF6686_ESP32/TEF6686_ESP32.ino.cpp
    if (!initdxscan) {
      switch (scancancel) {
        case CORRECTPI:
          if (RDSstatus && radio.rds.correctPI != 0) cancelDXScan();
          break;
        case SIGNAL:
          if ((USN < fmscansens * 30) && (WAM < 230) && (OStatus < 80 && OStatus > -80) && (Squelch < SStatus || Squelch == 920)) cancelDXScan();
          break;
      }
    }
  }

  if (millis() >= tuningtimer + 200) rdsflagreset = false;

  if (millis() >= tuningtimer + 2000) {
    if (store) {
      StoreFrequency();
      store = false;
    }
  }

  if (!BWtune && !menu && !afscreen && !rdsstatscreen && !scandxmode) {
    if (af != 0 && dropout && millis() >= aftimer + 1000) {
      aftimer = millis();
      if (radio.af_counter == 0) {
        if (findMemoryAF && radio.rds.correctPI != 0 && tunemode == TUNE_MEM && (USN > 250 || WAM > 250)) {
          radio.setMute();
          tft.drawBitmap(249, 4, Speaker, 28, 24, PrimaryColor);
          SQ = true;
          if (!screenmute) {
            if (advancedRDS) {
              tft.drawRoundRect(10, 30, 300, 170, 2, ActiveColor);
              tft.fillRoundRect(12, 32, 296, 166, 2, BackgroundColor);
              tftPrint(ACENTER, textUI(34), 160, 100, ActiveColor, ActiveColorSmooth, 28);
            } else {
              ShowFreq(1);
            }
          }

          bool foundmemaf = false;
          for (int x = 8750; x <= 10800; x += 10) {
            if (rotary != 0 || digitalRead(BANDBUTTON) == LOW || digitalRead(MODEBUTTON) == LOW || digitalRead(BWBUTTON) == LOW || digitalRead(ROTARY_BUTTON) == LOW) break;
            radio.SetFreq(x);
            unsigned long millisold = millis();
            while (millis() - millisold < 187) {
              if (!screenmute && !advancedRDS) ShowModLevel();
            }
            if (radio.rds.correctPI == radio.getBlockA()) {
              frequency = x;
              foundmemaf = true;
              break;
            }
          }

          if (!foundmemaf) {
            frequency = freqold;
            radio.SetFreq(frequency);
          }

          if (!screenmute) {
            if (advancedRDS) {
              leave = true;
              BuildAdvancedRDS();
              freq_in = 0;
            } else {
              ShowFreq(0);
            }
          }

          radio.setUnMute();
          SQ = false;
          tft.drawBitmap(249, 4, Speaker, 28, 24, GreyoutColor);
        }
        findMemoryAF = false;
      } else {
        frequency = radio.TestAF();
      }
      if (freqold != frequency) {
        ShowFreq(0);
        dropout = true;
        if (radio.afmethodB) {
          afmethodBold = true;
          radio.clearRDS(fullsearchrds);
        }
      }
      if (XDRGTKUSB || XDRGTKTCP) DataPrint("T" + String((frequency + ConverterSet * 100) * 10) + "\n");
      if (screenmute) {
        freqold = frequency;
        dropout = false;
      }
      store = true;
    }

    if (band == BAND_FM && af != 0 && radio.rds.correctPI != 0) {
      if ((aftest && millis() >= aftimer + 3000) || ((USN > 250 || WAM > 250) && millis() >= aftimer + 1000)) {
        aftimer = millis();
        aftest = false;
        frequency = radio.TestAF();
        if (freqold != frequency) {
          ShowFreq(0);
          dropout = true;
          if (radio.afmethodB) {
            afmethodBold = true;
            radio.clearRDS(fullsearchrds);
          }
          if (XDRGTKUSB || XDRGTKTCP) DataPrint("T" + String((frequency + ConverterSet * 100) * 10) + "\n");
          if (screenmute) {
            freqold = frequency;
            dropout = false;
          }
          store = true;
        }
      }

      if (band == BAND_FM && millis() >= aftimer + 10000) {
        aftimer = millis();
        if (USN > 150 || WAM > 150) {
          frequency = radio.TestAF();
          if (freqold != frequency) {
            ShowFreq(0);
            dropout = true;
            if (radio.afmethodB) {
              afmethodBold = true;
              radio.clearRDS(fullsearchrds);
            }
            if (XDRGTKUSB || XDRGTKTCP) DataPrint("T" + String((frequency + ConverterSet * 100) * 10) + "\n");
            store = true;
            if (screenmute) {
              freqold = frequency;
              dropout = false;
            }
          }
        }
      }
    }
  }

  if (seek) Seek(direction);

  if ((SStatus / 10 > LowLevelSet) && !LowLevelInit && !BWtune && !menu && band < BAND_GAP) {
    if (!screenmute && !advancedRDS && !rdsstatscreen && !afscreen) {
      if (showmodulation) {
        tftPrint(ALEFT, "10", 24, 144, ActiveColor, ActiveColorSmooth, 16);
        tftPrint(ALEFT, "30", 54, 144, ActiveColor, ActiveColorSmooth, 16);
        tftPrint(ALEFT, "50", 84, 144, ActiveColor, ActiveColorSmooth, 16);
        tftPrint(ALEFT, "70", 114, 144, ActiveColor, ActiveColorSmooth, 16);
        tftPrint(ALEFT, "100", 160, 144, ActiveColor, ActiveColorSmooth, 16);
        tftPrint(ACENTER, "A", 7, 128, ActiveColor, ActiveColorSmooth, 16);
        for (byte segments = 0; segments < 87; segments++) {
          if (segments > 54) {
            if (((segments - 53) % 10) == 0) tft.fillRect(16 + (2 * segments), 141, 2, 2, BarSignificantColor);
          } else {
            if (((segments + 1) % 6) == 0) tft.fillRect(16 + (2 * segments), 141, 2, 2, ModBarInsignificantColor);
          }
        }
      }
      if (radio.rds.region == 0) {
        tftPrint(ALEFT, "PI:", 212, 193, ActiveColor, ActiveColorSmooth, 16);
      } else {
        tftPrint(ALEFT, "PI:", 212, 184, ActiveColor, ActiveColorSmooth, 16);
        tftPrint(ALEFT, "ID:", 212, 201, ActiveColor, ActiveColorSmooth, 16);
      }
      tftPrint(ALEFT, "PS:", 3, 193, ActiveColor, ActiveColorSmooth, 16);
      tftPrint(ALEFT, "RT:", 3, 221, ActiveColor, ActiveColorSmooth, 16);
      tftPrint(ALEFT, "PTY:", 3, 163, ActiveColor, ActiveColorSmooth, 16);
      if (!showmodulation) tft.drawLine(16, 143, 189, 143, GreyoutColor); else tft.drawLine(16, 143, 189, 143, ActiveColor);
    }
    LowLevelInit = true;
  }

  if ((SStatus / 10 <= LowLevelSet) && band < BAND_GAP) {
    if (LowLevelInit && !BWtune && !menu) {
      if (!screenmute && !rdsstatscreen && !afscreen && !advancedRDS) {
        for (byte segments = 0; segments < 87; segments++) {
          if (segments > 54) {
            if (((segments - 53) % 10) == 0) tft.fillRect(16 + (2 * segments), 141, 2, 2, GreyoutColor);
          } else {
            if (((segments + 1) % 6) == 0) tft.fillRect(16 + (2 * segments), 141, 2, 2, GreyoutColor);
          }
        }
        if (showmodulation) {
          tftPrint(ALEFT, "10", 24, 144, GreyoutColor, BackgroundColor, 16);
          tftPrint(ALEFT, "30", 54, 144, GreyoutColor, BackgroundColor, 16);
          tftPrint(ALEFT, "50", 84, 144, GreyoutColor, BackgroundColor, 16);
          tftPrint(ALEFT, "70", 114, 144, GreyoutColor, BackgroundColor, 16);
          tftPrint(ALEFT, "100", 160, 144, GreyoutColor, BackgroundColor, 16);
          tftPrint(ACENTER, "A", 7, 128, GreyoutColor, BackgroundColor, 16);
          tft.fillRect(16, 133, 174, 6, GreyoutColor);
        }
        if (radio.rds.region == 0) {
          tftPrint(ALEFT, "PI:", 212, 193, GreyoutColor, BackgroundColor, 16);
        } else {
          tftPrint(ALEFT, "PI:", 212, 184, GreyoutColor, BackgroundColor, 16);
          tftPrint(ALEFT, "ID:", 212, 201, GreyoutColor, BackgroundColor, 16);
        }
        tftPrint(ALEFT, "PS:", 3, 193, GreyoutColor, BackgroundColor, 16);
        tftPrint(ALEFT, "RT:", 3, 221, GreyoutColor, BackgroundColor, 16);
        tftPrint(ALEFT, "PTY:", 3, 163, GreyoutColor, BackgroundColor, 16);
        tft.drawLine(16, 143, 189, 143, GreyoutColor);
        tft.drawBitmap(68, 5, RDSLogo, 35, 22, GreyoutColor);
      }
      modLevelForceRedraw = true;
      LowLevelInit = false;
    }

    if (!BWtune && !menu && (screenmute || radio.rds.correctPI != 0)) readRds();
    if (millis() >= lowsignaltimer + 300) {
      lowsignaltimer = millis();
      if (af || (!screenmute || (screenmute && (XDRGTKTCP || XDRGTKUSB)))) {
        if (band < BAND_GAP) {
          radio.getStatus(SStatus, USN, WAM, OStatus, BW, MStatus, CN);
        } else {
          radio.getStatusAM(SStatus, USN, WAM, OStatus, BW, MStatus, CN);
        }
      }
      if (!BWtune && !menu) {
        doSquelch();
        GetData();
      }
    }

  } else {
    if (af || (!screenmute || (screenmute && (XDRGTKTCP || XDRGTKUSB)))) {
      if (band < BAND_GAP) {
        radio.getStatus(SStatus, USN, WAM, OStatus, BW, MStatus, CN);
      } else {
        radio.getStatusAM(SStatus, USN, WAM, OStatus, BW, MStatus, CN);
      }
    }
    if (!BWtune && !menu) {
      doSquelch();
      if (millis() >= tuningtimer + 200) readRds();
      GetData();
      if (!screenmute && !rdsstatscreen && !afscreen && !advancedRDS) ShowModLevel();
    }
  }

  if (rotary == -1) {
    tottimer = millis();
    if (screensavertriggered) {
      if (!touchrotating) {
        rotary = 0;
        WakeToSleep(REVERSE);
      } else {
        if (BWtune) doBWtuneUp(); else KeyUp();
      }
    } else {
      if (BWtune) doBWtuneUp(); else KeyUp();
      if (rotaryaccelerate && rotarycounter > 2 && !BWtune && !menu) {
        for (int i = 0; i < rotarycounteraccelerator; i++) KeyUp();
        rotarycounter = 0;
      }
      if (screensaverset > 0 && !BWtune && !menu && !screensavertriggered) screensavertimer = millis();
    }
  }

  if (rotary == 1) {
    tottimer = millis();
    if (screensavertriggered) {
      if (!touchrotating) {
        rotary = 0;
        WakeToSleep(REVERSE);
      } else {
        if (BWtune) doBWtuneDown(); else KeyDown();
      }
    } else {
      if (BWtune) doBWtuneDown(); else KeyDown();
      if (rotaryaccelerate && rotarycounter > 2 && !BWtune && !menu) {
        for (int i = 0; i < rotarycounteraccelerator; i++) KeyDown();
        rotarycounter = 0;
      }
      if (screensaverset > 0 && !BWtune && !menu && !screensavertriggered) screensavertimer = millis();
    }
  }

  if (digitalRead(BANDBUTTON) == LOW) {
    tottimer = millis();
    if (screensavertriggered) {
      WakeToSleep(REVERSE);
      while (digitalRead(BANDBUTTON) == LOW);
    } else {
      BANDBUTTONPress();
    }
  }

  if (digitalRead(ROTARY_BUTTON) == LOW) {
    tottimer = millis();
    if (screensavertriggered) {
      WakeToSleep(REVERSE);
      while (digitalRead(ROTARY_BUTTON) == LOW);
    } else {
      if (!afscreen && !rdsstatscreen) ButtonPress();
    }
  }

  if (digitalRead(MODEBUTTON) == LOW) {
    tottimer = millis();
    if (screensavertriggered) {
      WakeToSleep(REVERSE);
      while (digitalRead(MODEBUTTON) == LOW);
    } else {
      if (!screenmute) ModeButtonPress();
    }
  }

