PE5PVB/TEF6686_ESP32/TEF6686_ESP32.ino.cpp
  if (RDSSPYUSB) Serial.print("G:\r\nRESET-------\r\n\r\n");
  if (RDSSPYTCP) RemoteClient.print("G:\r\nRESET-------\r\n\r\n");
  if (XDRGTKUSB || XDRGTKTCP) DataPrint("T" + String((frequency + ConverterSet * 100) * 10) + "\n");

  String stationText = "";
  if (presets[memorypos].RDSPS[0] != '\0') {
    for (byte i = 0; i < 9; i++) stationText += presets[memorypos].RDSPS[i];
  }

  if (presets[memorypos].RDSPI[0] != '\0') {
    for (byte i = 0; i < 4; i++) {
      radio.rds.picode[i] = presets[memorypos].RDSPI[i];
    }
    radio.rds.picode[4] = ' ';
    radio.rds.picode[5] = ' ';
    radio.rds.picode[6] = '\0';
    radio.rds.correctPI = (uint16_t)strtol(radio.rds.picode, NULL, 16);
  } else {
    for (byte i = 0; i < 6; i++) {
      radio.rds.picode[i] = '\0';
    }
  }

  radio.rds.stationName = stationText;

  BWset = presets[memorypos].bw;
  doBW();
  memtune = true;
  memreset = true;
  rdsflagreset = false;
  findMemoryAF = true;
  ShowFreq(0);
}

void ShowFreq(int mode) {
  if (!setupmode) {
    if (band != BAND_FM && band != BAND_OIRT) {
      if (freqold < 2000 && frequency_AM >= 2000 && stepsize == 0) if (frequency_AM != 27000 && freqold != 144) radio.SetFreqAM(2000);
      if (freqold >= 2000 && frequency_AM < 2000 && stepsize == 0) if (frequency_AM != 144 && freqold != 27000) radio.SetFreqAM(1998);
    }
  }

  if (band > BAND_GAP) {
    switch (band) {
      case BAND_LW: frequency_AM = frequency_LW; break;
      case BAND_MW: frequency_AM = frequency_MW; break;
      case BAND_SW: frequency_AM = frequency_SW; break;
#ifdef HAS_AIR_BAND
      case BAND_AIR: frequency_AM = frequency_AIR; break;
#endif
    }

    if (!screenmute) {
      FrequencySprite.fillSprite(BackgroundColor);

      switch (freqfont) {
        case 1: FrequencySprite.loadFont(FREQFONT1); break;
        case 2: FrequencySprite.loadFont(FREQFONT2); break;
        case 3: FrequencySprite.loadFont(FREQFONT3); break;
        case 4: FrequencySprite.loadFont(FREQFONT4); break;
        default: FrequencySprite.loadFont(FREQFONT0); break;
      }

      FrequencySprite.setTextDatum(TR_DATUM);
      FrequencySprite.setTextColor(FreqColor, FreqColorSmooth, false);
      if (band == BAND_AIR) {
        FrequencySprite.drawString(String(frequency_AM / 1000) + "." + String(frequency_AM % 1000) + " ", 218, -6);
      } else {
        FrequencySprite.drawString(String(frequency_AM) + " ", 218, -6);
      }
      FrequencySprite.unloadFont();
      FrequencySprite.setTextColor(PrimaryColor, PrimaryColorSmooth, false);
      FrequencySprite.setTextDatum(TL_DATUM);
      FrequencySprite.loadFont(FONT16);

      if (band == BAND_SW && showSWMIBand) {
        DivdeSWMIBand();
        updateSWMIBand();
      }

      FrequencySprite.unloadFont();
      FrequencySprite.pushSprite(46, 46);
    }

    freqold = frequency_AM;
  } else {
    unsigned int freq = 0;
    if (band == BAND_FM) freq = frequency + ConverterSet * 100;
    if (band == BAND_OIRT) freq = frequency_OIRT;

    if (!screenmute) {
      if (advancedRDS) {
        for (int i = 0; i < 33; i++) tft.fillCircle((6 * i) + 10, 133, 2, GreyoutColor);
        tftReplace(ARIGHT, String(freqold / 100) + "." + (freqold % 100 < 10 ? "0" : "") + String(freqold % 100), String(freq / 100) + "." + (freq % 100 < 10 ? "0" : "") + String(freq % 100), 273, 35, PrimaryColor, PrimaryColorSmooth, BackgroundColor, 16);
        freqold = freq;
      } else if (afscreen) {
        tftReplace(ARIGHT, String(freqold / 100) + "." + (freqold % 100 < 10 ? "0" : "") + String(freqold % 100) + " MHz", String(freq / 100) + "." + (freq % 100 < 10 ? "0" : "") + String(freq % 100), 290, 201, BWAutoColor, BWAutoColorSmooth, BackgroundColor, 16);
        freqold = freq;
      } else {
        switch (freqfont) {
          case 1: FrequencySprite.loadFont(FREQFONT1); break;
          case 2: FrequencySprite.loadFont(FREQFONT2); break;
          case 3: FrequencySprite.loadFont(FREQFONT3); break;
          case 4: FrequencySprite.loadFont(FREQFONT4); break;
          default: FrequencySprite.loadFont(FREQFONT0); break;
        }

        FrequencySprite.fillSprite(BackgroundColor);

        if (mode == 0) {
          FrequencySprite.setTextDatum(TR_DATUM);
          FrequencySprite.setTextColor(FreqColor, FreqColorSmooth, false);
        } else {
          FrequencySprite.unloadFont();
          FrequencySprite.setTextColor(ActiveColor, ActiveColorSmooth, false);
          FrequencySprite.setTextDatum(TC_DATUM);
          if (language == LANGUAGE_CHS) FrequencySprite.loadFont(FONT16_CHS); else FrequencySprite.loadFont(FONT16);
        }

        switch (mode) {
          case 0:
            FrequencySprite.drawString(String(freq / 100) + "." + (freq % 100 < 10 ? "0" : "") + String(freq % 100) + " ", 218, -6);
            freqold = freq;
            break;

          case 1: Infoboxprint(textUI(34)); break;
          case 2: Infoboxprint(textUI(290)); break;
          case 3: Infoboxprint(textUI(291)); break;
          case 4: Infoboxprint(textUI(295)); break;
          case 5: Infoboxprint(textUI(284)); break;
        }

        FrequencySprite.pushSprite(46, 46);
        FrequencySprite.unloadFont();
        if (mode == 5) delay(1000);
      }
    }
  }

  if (spispeed == 7) setAutoSpeedSPI();
  rdsreset = true;
  licold = 254;
  ECCold = 253;
  afmethodBold = false;
  aid_counterold = 0;
  dropout = false;

  if (wifi && remoteip != IPAddress(0, 0, 0, 0)) {
    Udp.beginPacket(remoteip, 9030);
    if (band == BAND_FM) {
      Udp.print("from=TEF_tuner_" + String(stationlistid, DEC) + ";freq=" + String(frequency) + "0000");
    } else if (band == BAND_OIRT) {
      Udp.print("from=TEF_tuner_" + String(stationlistid, DEC) + ";freq=" + String(frequency_OIRT) + "0000");
    } else {
      Udp.print("from=TEF_tuner_" + String(stationlistid, DEC) + ";freq=" + String(frequency_AM) + "000");
    }
    Udp.endPacket();
  }
  tuningtimer = millis();

  if (!rdsflagreset && !screenmute && !afscreen && !rdsstatscreen) {
    ShowRDSLogo(false);
    if (!advancedRDS) {
      FullLineSprite.fillSprite(BackgroundColor);
      FullLineSprite.drawLine(283, 0, 283, 19, FrameColor);
      FullLineSprite.pushSprite(36, 220);
      tft.fillCircle(314, 223, 2, GreyoutColor);
      tft.fillCircle(314, 234, 2, GreyoutColor);
    } else {
      RDSSprite.fillSprite(BackgroundColor);
      RDSSprite.pushSprite(36, 220);
      tft.fillCircle(203, 223, 2, GreyoutColor);
      tft.fillCircle(203, 234, 2, GreyoutColor);
    }
    rdsflagreset = true;
  }
}

void ShowSignalLevel() {
  SAvg = (((SAvg * 9) + 5) / 10) + SStatus;
  SAvg2 = (((SAvg2 * 9) + 5) / 10) + CN;
  SAvg4 = (((SAvg4 * 9) + 5) / 10) + WAM;
  SAvg5 = (((SAvg5 * 9) + 5) / 10) + USN;

  float sval = 0;
  int16_t smeter = 0;

  if (SStatus > 0) {
    if (SStatus < 1000) {
      sval = 51 * ((pow(10, (((float)SStatus) / 1000))) - 1);
      smeter = int16_t(sval);
    } else {
      smeter = 511;
    }
  }

  SStatus = SAvg / 10;
  CN = SAvg2 / 10;
  MP = SAvg4 / 10;
  US = SAvg5 / 10;

  if (!screenmute) {
    if (millis() >= SNRupdatetimer + TIMER_SNR_TIMER) {
      SNRupdatetimer = millis();
      if (!advancedRDS) {
        if (CN > (CNold + 1) || CN < (CNold - 1)) {
          if (CNold == 0) tftPrint(ARIGHT, "--", 234, 165, BackgroundColor, BackgroundColor, 16); else tftPrint(ARIGHT, String(CNold), 234, 165, BackgroundColor, BackgroundColor, 16);
          if (tuned) {
            if (CN == 0) tftPrint(ARIGHT, "--", 234, 165, PrimaryColor, PrimaryColorSmooth, 16); else tftPrint(ARIGHT, String(CN), 234, 165, PrimaryColor, PrimaryColorSmooth, 16);
            CNold = CN;
          } else {
            tftPrint(ARIGHT, "--", 234, 165, PrimaryColor, PrimaryColorSmooth, 16);
            CNold = 0;
          }
        }
        byte MPprint;
        MPprint = constrain(map(MP, 0, 1000, 0, 99), 0, 99);

        if (MPprint != MPold) {
          tftReplace(ARIGHT, String(MPold), (band < BAND_GAP ? String(MPprint) : "--"), 299, 165, PrimaryColor, PrimaryColorSmooth, BackgroundColor, 16);
          MPold = MPprint;
        }

        byte USprint;
        USprint = constrain(map(US, 0, 1000, 0, 99), 0, 99);

        if (USprint != USold) {
          tftReplace(ARIGHT, String(USold), (band < BAND_GAP ? String(USprint) : "--"), 299, 147, PrimaryColor, PrimaryColorSmooth, BackgroundColor, 16);
          USold = USprint;
        }
      }
    }

    if (!menu) analogWrite(SMETERPIN, smeter);

