PE5PVB/TEF6686_ESP32/TEF6686_ESP32.ino.cpp
    int SStatusprint = 0;
    if (unit == 0) SStatusprint = SStatus;
    if (unit == 1) SStatusprint = ((SStatus * 100) + 10875) / 100;
    if (unit == 2) SStatusprint = round((float(SStatus) / 10.0 - 10.0 * log10(75) - 90.0) * 10.0);

    static int DisplayedSignalSegments = 0;

    if (SStatusprint > (SStatusold + 3) || SStatusprint < (SStatusold - 3)) {
      if (advancedRDS) {
        tftReplace(ARIGHT, String(SStatusold / 10) + "." + String(abs(SStatusold % 10)),
                   String(SStatusprint / 10) + "." + String(abs(SStatusprint % 10)),
                   273, 51, PrimaryColor, PrimaryColorSmooth, BackgroundColor, 16);
      } else {
        if (SStatusold / 10 != SStatusprint / 10) {
          tftReplace(ARIGHT, String(SStatusold / 10), String(SStatusprint / 10),
                     280, 104, FreqColor, FreqColorSmooth, BackgroundColor, 48);
        }
        tftReplace(ALEFT, "." + String(abs(SStatusold % 10)),
                   "." + String(abs(SStatusprint % 10)),
                   285, 102, FreqColor, FreqColorSmooth, BackgroundColor, 28);


        if (band < BAND_GAP) {
          DisplayedSignalSegments = constrain(map(SStatus / 10, 0, 70, 0, 100), 0, 87);
        } else {
          DisplayedSignalSegments = constrain((SStatus + 200) / 10, 0, 87);
        }


        HSV hsv1 = RGB565toHSV(BarInsignificantColor);
        HSV hsv2 = RGB565toHSV(BarSignificantColor);

        int gradientStart = (87 * 25) / 100;
        int gradientEnd = (87 * 60) / 100;


        for (int i = 0; i < min(DisplayedSignalSegments, gradientStart); i++) {
          tft.fillRect(16 + 2 * i, 105, 2, 6, BarInsignificantColor);
        }


        if (DisplayedSignalSegments > gradientStart) {
          for (int i = gradientStart; i < min(DisplayedSignalSegments, gradientEnd); i++) {

            float h = map(i, gradientStart, gradientEnd, hsv1.h, hsv2.h);
            float s = map(i, gradientStart, gradientEnd, hsv1.s * 100, hsv2.s * 100) / 100.0;
            float v = map(i, gradientStart, gradientEnd, hsv1.v * 100, hsv2.v * 100) / 100.0;


            uint16_t gradientColor = HSVtoRGB565(h, s, v);

            tft.fillRect(16 + 2 * i, 105, 2, 6, gradientColor);
          }
        }


        if (DisplayedSignalSegments > gradientEnd) {
          for (int i = gradientEnd; i < DisplayedSignalSegments; i++) {
            tft.fillRect(16 + 2 * i, 105, 2, 6, BarSignificantColor);
          }
        }


        int greyStart = 16 + 2 * DisplayedSignalSegments;
        int greyWidth = 2 * (87 - DisplayedSignalSegments);
        tft.fillRect(greyStart, 105, greyWidth, 6, GreyoutColor);
      }

      SStatusold = SStatusprint;
    }
  }

  if (!seek) {
    if (tuned && CN > 15 && SStatus > 300) {
      if (!setextendbw) {
        setextendbw = true;
        radio.extendBW(true);
      }
    } else {
      if (setextendbw) {
        setextendbw = false;
        radio.extendBW(false);
      }
    }
  }

  if (wifi && remoteip != IPAddress(0, 0, 0, 0) && millis() >= udptimer + 2000) {
    udptimer = millis();
    Udp.beginPacket(remoteip, 9030);
    Udp.print("from=TEF_tuner_" + String(stationlistid, DEC) + ";RcvLevel=" + String(SStatus / 10));
    Udp.endPacket();
  }
}

void ShowRDSLogo(bool RDSstatus) {
  if (!screenmute) {
    if (RDSstatus != RDSstatusold) {
      if (RDSstatus) {
        tft.drawBitmap(68, 5, RDSLogo, 35, 22, RDSColor);
      } else {
        tft.drawBitmap(68, 5, RDSLogo, 35, 22, GreyoutColor);
      }
    }
    RDSstatusold = RDSstatus;
  }
}

void ShowStereoStatus() {
  if (StereoToggle) {
    if (band < BAND_GAP) Stereostatus = radio.getStereoStatus(); else Stereostatus = false;
    if (Stereostatus != Stereostatusold) {
      if (Stereostatus && !screenmute) {
        tft.drawBitmap(32, 5, Stereo, 32, 22, StereoColor);
      } else {
        if (!screenmute) {
          tft.drawBitmap(32, 5, Stereo, 32, 22, GreyoutColor);
        }
      }
      Stereostatusold = Stereostatus;
    }
  }
}

void ShowOffset() {
  if (OStatus != OStatusold) {
    if (millis() >= offsetupdatetimer + TIMER_OFFSET_TIMER) {
      offsetupdatetimer = millis();
    } else {
      return;
    }

    int baseX = 13;
    int baseY = 2;
    int width = 4;
    int height = 26;

    int centerX = baseX + width / 2;
    int centerY = baseY + height / 2;


    int arrowGap = 3;
    int arrowWidth = 9;
    int leftArrowBaseX = centerX - arrowWidth - arrowGap;
    int rightArrowBaseX = centerX + arrowWidth + arrowGap;

    int arrowBaseYTop = baseY + 1;
    int arrowBaseYBottom = baseY + height - 1;

    if (band < BAND_GAP) {
      if (OStatus < -250) {

        tft.fillTriangle(leftArrowBaseX, arrowBaseYTop, centerX - arrowGap, centerY, leftArrowBaseX, arrowBaseYBottom, GreyoutColor);

        tft.fillCircle(centerX, centerY, 3, GreyoutColor);

        tft.fillTriangle(rightArrowBaseX, arrowBaseYTop, centerX + arrowGap, centerY, rightArrowBaseX, arrowBaseYBottom, SignificantColor);
        tuned = false;
      } else if (USN < 250 && WAM < 250 && OStatus > -250 && OStatus < 250 && !SQ) {

        tft.fillTriangle(leftArrowBaseX, arrowBaseYTop, centerX - arrowGap, centerY, leftArrowBaseX, arrowBaseYBottom, GreyoutColor);
        tft.fillTriangle(rightArrowBaseX, arrowBaseYTop, centerX + arrowGap, centerY, rightArrowBaseX, arrowBaseYBottom, GreyoutColor);

        tft.fillCircle(centerX, centerY, 3, InsignificantColor);
        tuned = true;
      } else if (OStatus > 250) {

        tft.fillTriangle(rightArrowBaseX, arrowBaseYTop, centerX + arrowGap, centerY, rightArrowBaseX, arrowBaseYBottom, GreyoutColor);

        tft.fillCircle(centerX, centerY, 3, GreyoutColor);

        tft.fillTriangle(leftArrowBaseX, arrowBaseYTop, centerX - arrowGap, centerY, leftArrowBaseX, arrowBaseYBottom, SignificantColor);
        tuned = false;
      } else {

        tft.fillTriangle(leftArrowBaseX, arrowBaseYTop, centerX - arrowGap, centerY, leftArrowBaseX, arrowBaseYBottom, GreyoutColor);
        tft.fillTriangle(rightArrowBaseX, arrowBaseYTop, centerX + arrowGap, centerY, rightArrowBaseX, arrowBaseYBottom, GreyoutColor);
        tft.fillCircle(centerX, centerY, 3, GreyoutColor);
        tuned = false;
      }
    } else {
      if (OStatus < -2) {

