PE5PVB/TEF6686_ESP32/TEF6686_ESP32.ino.cpp
        tft.fillTriangle(leftArrowBaseX, arrowBaseYTop, centerX - arrowGap, centerY, leftArrowBaseX, arrowBaseYBottom, GreyoutColor);
        tft.fillCircle(centerX, centerY, 3, GreyoutColor);

        tft.fillTriangle(rightArrowBaseX, arrowBaseYTop, centerX + arrowGap, centerY, rightArrowBaseX, arrowBaseYBottom, SignificantColor);
        tuned = false;
      } else if (OStatus >= -2 && OStatus <= 2 && !SQ) {
        tft.fillTriangle(leftArrowBaseX, arrowBaseYTop, centerX - arrowGap, centerY, leftArrowBaseX, arrowBaseYBottom, GreyoutColor);
        tft.fillTriangle(rightArrowBaseX, arrowBaseYTop, centerX + arrowGap, centerY, rightArrowBaseX, arrowBaseYBottom, GreyoutColor);
        tft.fillCircle(centerX, centerY, 3, InsignificantColor);
        tuned = true;
      } else if (OStatus > 2) {

        tft.fillTriangle(rightArrowBaseX, arrowBaseYTop, centerX + arrowGap, centerY, rightArrowBaseX, arrowBaseYBottom, GreyoutColor);
        tft.fillCircle(centerX, centerY, 3, GreyoutColor);

        tft.fillTriangle(leftArrowBaseX, arrowBaseYTop, centerX - arrowGap, centerY, leftArrowBaseX, arrowBaseYBottom, SignificantColor);
        tuned = false;
      } else {
        tft.fillTriangle(leftArrowBaseX, arrowBaseYTop, centerX - arrowGap, centerY, leftArrowBaseX, arrowBaseYBottom, GreyoutColor);
        tft.fillTriangle(rightArrowBaseX, arrowBaseYTop, centerX + arrowGap, centerY, rightArrowBaseX, arrowBaseYBottom, GreyoutColor);
        tft.fillCircle(centerX, centerY, 3, GreyoutColor);
        tuned = false;
      }
    }
    OStatusold = OStatus;
  }
}

void ShowBW() {
  if (!BWtune && millis() >= bwupdatetimer + TIMER_BW_TIMER) {
    bwupdatetimer = millis();
  } else {
    if (!BWtune) return;
  }

  if (BW != BWOld || BWreset) {
    if (BWset == 0) tftReplace(ARIGHT, String (BWOld, DEC), String (BW, DEC), 203, 4, BWAutoColor, BWAutoColorSmooth, BackgroundColor, 28); else tftReplace(ARIGHT, String (BWOld, DEC), String (BW, DEC), 203, 4, PrimaryColor, PrimaryColorSmooth, BackgroundColor, 28);
    BWOld = BW;
    BWreset = false;
    if (wifi && remoteip != IPAddress(0, 0, 0, 0)) {
      Udp.beginPacket(remoteip, 9030);
      Udp.print("from=TEF_tuner_" + String(stationlistid, DEC) + ";bandwidth=" + String(BW * 1000));
      Udp.endPacket();
    }
  }
}

void ShowModLevel() {
  if (showmodulation) {
    int segments;
    MStatus = (MStatus > 120) ? 120 : MStatus;

    if (seek || SQ) {
      MStatus = 0;
      MStatusold = 1;
    }

    segments = constrain(map(MStatus, 0, 120, 0, 86), 0, 86);

    if (segments < DisplayedSegments && (millis() - ModulationpreviousMillis >= 20)) {
      DisplayedSegments = max(DisplayedSegments - 3, segments);
      ModulationpreviousMillis = millis();
    } else if (segments > DisplayedSegments) {
      DisplayedSegments = segments;
    }

    DisplayedSegments = constrain(DisplayedSegments, 0, 86);

    if (DisplayedSegments > peakholdold) {
      peakholdold = DisplayedSegments;
      peakholdmillis = millis();
    }

    if (millis() - peakholdmillis >= 1000) {
      if (millis() - ModulationpeakPreviousMillis >= 20) {
        peakholdold = max(peakholdold - 3, DisplayedSegments);
        ModulationpeakPreviousMillis = millis();
      }
    }

    peakholdold = constrain(peakholdold, 0, 86);


    static int prevDisplayedSegments = -1;
    static int prevPeakhold = -1;
    if (!modLevelForceRedraw && DisplayedSegments == prevDisplayedSegments && peakholdold == prevPeakhold) {
      return;
    }
    modLevelForceRedraw = false;


    static uint16_t modGradient[87];
    static uint16_t cachedInsigColor = 0;
    static uint16_t cachedSigColor = 0;
    static bool gradientReady = false;

    if (!gradientReady || cachedInsigColor != ModBarInsignificantColor || cachedSigColor != ModBarSignificantColor) {
      HSV hsv1 = RGB565toHSV(ModBarInsignificantColor);
      HSV hsv2 = RGB565toHSV(ModBarSignificantColor);
      int gStart = (86 * 25) / 100;
      int gEnd = (86 * 60) / 100;
      for (int i = 0; i < 87; i++) {
        if (i < gStart) {
          modGradient[i] = ModBarInsignificantColor;
        } else if (i < gEnd) {
          float h = map(i, gStart, gEnd, hsv1.h, hsv2.h);
          float s = map(i, gStart, gEnd, hsv1.s * 100, hsv2.s * 100) / 100.0;
          float v = map(i, gStart, gEnd, hsv1.v * 100, hsv2.v * 100) / 100.0;
          modGradient[i] = HSVtoRGB565(h, s, v);
        } else {
          modGradient[i] = ModBarSignificantColor;
        }
      }
      cachedInsigColor = ModBarInsignificantColor;
      cachedSigColor = ModBarSignificantColor;
      gradientReady = true;
    }


    for (int i = 0; i < DisplayedSegments; i++) {
      tft.fillRect(16 + 2 * i, 133, 2, 6, modGradient[i]);
    }


    int greyStart = 16 + 2 * DisplayedSegments;
    int greyWidth = (16 + 2 * 87) - greyStart;
    tft.fillRect(greyStart, 133, greyWidth, 6, GreyoutColor);


    int peakHoldPosition = constrain(16 + 2 * peakholdold, 16, 16 + 2 * 86);
    tft.fillRect(peakHoldPosition, 133, 2, 6, (MStatus > 80) ? ModBarSignificantColor : PrimaryColor);

    if (millis() - peakholdmillis >= 1000) {
      if (peakholdold <= DisplayedSegments || peakholdold >= 86) {
        tft.fillRect(peakHoldPosition, 133, 2, 6, GreyoutColor);
      }
    }

    prevDisplayedSegments = DisplayedSegments;
    prevPeakhold = peakholdold;
  }
}

void showAutoSquelch(bool mode) {
  if (mode) {
    tft.drawBitmap(223, 145, AutoSQ, 18, 18, PrimaryColor);
  } else {
    tft.drawBitmap(223, 145, AutoSQ, 18, 18, BackgroundColor);
  }
}

void doSquelch() {
  if (!XDRGTKUSB && !XDRGTKTCP && usesquelch && !autosquelch) Squelch = map(analogRead(PIN_POT), 0, 4095, -100, 920);
  if (Squelch < - 800) Squelch = -100;
  if (Squelch > 900) Squelch = 920;

  if (unit == 0) SquelchShow = Squelch / 10;
  if (unit == 1) SquelchShow = ((Squelch * 100) + 10875) / 1000;
  if (unit == 2) SquelchShow = round((float(Squelch) / 10.0 - 10.0 * log10(75) - 90.0) * 10.0) / 10;
  if (Squelch > 920) Squelch = 920;

  if (autosquelch) {
    if (band < BAND_GAP) {
      if ((USN < fmscansens * 30) && (WAM < 230) && (OStatus < 100 && OStatus > -100) && (!scandxmode || (scandxmode && !scanmute))) {
        if (SQ || BWreset) {
          if (!seek) radio.setUnMute();
          if (!screenmute && !seek) {
            tft.drawBitmap(249, 4, Speaker, 28, 24, GreyoutColor);
          }
          autosquelchtimer = millis();
          SQ = false;
        }
      } else {
        if ((!SQ || BWreset) && (millis() >= autosquelchtimer + 1000)) {
          radio.setMute();
          if (!screenmute && !seek) {
            tft.drawBitmap(249, 4, Speaker, 28, 24, PrimaryColor);
          }
          autosquelchtimer = millis();
          SQ = true;
        }
      }
    } else {
      if ((USN < amscansens * 30) && (OStatus < 2 && OStatus > -2) && (!scandxmode || (scandxmode && !scanmute))) {
        if (!seek) radio.setUnMute();
        if (!screenmute && !seek) {
          tft.drawBitmap(249, 4, Speaker, 28, 24, GreyoutColor);
        }
        SQ = false;
      } else {
        radio.setMute();
        if (!screenmute && !seek) {
          tft.drawBitmap(249, 4, Speaker, 28, 24, PrimaryColor);
        }
        SQ = true;
      }
    }
  } else {
    if (language == LANGUAGE_CHS) SquelchSprite.loadFont(FONT16_CHS); else SquelchSprite.loadFont(FONT16);

    if (!XDRGTKUSB && !XDRGTKTCP && usesquelch && (!scandxmode || (scandxmode && !scanmute))) {
      if (!screenmute && usesquelch && !advancedRDS && !afscreen && !rdsstatscreen) {
        if (!BWtune && !menu && (Squelch > Squelchold + 2 || Squelch < Squelchold - 2)) {
          SquelchSprite.setTextColor(PrimaryColor, PrimaryColorSmooth, false);
          SquelchSprite.fillSprite(BackgroundColor);
          if (Squelch == -100) {
            SquelchSprite.drawString("--", 0, 0);
          } else if (Squelch == 920) {
            SquelchSprite.drawString("ST", 0, 0);
          } else {
            SquelchSprite.drawString(String(SquelchShow), 0, 0);
          }
          SquelchSprite.pushSprite(223, 147);
          Squelchold = Squelch;
        }
      }
    }

    if ((XDRGTKUSB || XDRGTKTCP) && (!scandxmode || (scandxmode && !scanmute))) {
      if (!XDRMute) {
        if (Squelch != -1) {
          if (Squelch < SStatus || Squelch == -100 || Squelch == 0) {
            if (!seek) radio.setUnMute();
            if (!screenmute && !seek) {
              tft.drawBitmap(249, 4, Speaker, 28, 24, GreyoutColor);
            }
            SQ = false;
          } else {
            radio.setMute();
            if (!screenmute && !seek) {
              tft.drawBitmap(249, 4, Speaker, 28, 24, PrimaryColor);
            }
            SQ = true;
          }
        } else {
          if (Stereostatus) {
            radio.setUnMute();
            if (!screenmute && !seek) {
              tft.drawBitmap(249, 4, Speaker, 28, 24, GreyoutColor);
            }
            SQ = false;
          } else {
            radio.setMute();
            if (!screenmute && !seek) {
              tft.drawBitmap(249, 4, Speaker, 28, 24, PrimaryColor);
            }
            SQ = true;
          }
        }
        if (!screenmute && usesquelch && !advancedRDS && !afscreen && !rdsstatscreen) {
          if (Squelch != Squelchold) {
            SquelchSprite.setTextColor(PrimaryColor, PrimaryColorSmooth, false);
            SquelchSprite.fillSprite(BackgroundColor);

            if (Squelch == -1) {
              SquelchSprite.drawString("ST", 0, 0);
            } else if (Squelch == 0) {
              SquelchSprite.drawString("--", 0, 0);
            } else {
              SquelchSprite.drawString(String(SquelchShow), 0, 0);
            }
            if (Squelch != Squelchold) {
              SquelchSprite.pushSprite(223, 147);
            }
            Squelchold = Squelch;
          }
        }
      }
    } else if (usesquelch && (!scandxmode || (scandxmode && !scanmute))) {
      if (Squelch != 920) {
        if (Squelch < SStatus || Squelch == -100 || Squelch == 0) {
          if (!seek) radio.setUnMute();
          if (!screenmute && !seek) {
            tft.drawBitmap(249, 4, Speaker, 28, 24, GreyoutColor);
          }
          SQ = false;
        } else {
          radio.setMute();
          if (!screenmute && !seek) {
            tft.drawBitmap(249, 4, Speaker, 28, 24, PrimaryColor);
          }
          SQ = true;
        }
      } else {
        if (Stereostatus) {
          if (!seek) radio.setUnMute();
          if (!screenmute && !seek) {
            tft.drawBitmap(249, 4, Speaker, 28, 24, GreyoutColor);
          }
          SQ = false;
        } else {
          radio.setMute();
          if (!screenmute && !seek) {
            tft.drawBitmap(249, 4, Speaker, 28, 24, PrimaryColor);
          }
          SQ = true;
        }
      }
    }
  }
  SquelchSprite.unloadFont();
}

void updateBW() {
  if (BWset == 0) {
    if (!BWtune && !screenmute && !advancedRDS && !afscreen && !rdsstatscreen) {
      tft.fillRoundRect(248, 36, 69, 18, 2, SecondaryColor);
      tftPrint(ACENTER, "AUTO BW", 282, 38, BackgroundColor, SecondaryColor, 16);
    }
    radio.setFMABandw();
  } else {
    if (!BWtune && !screenmute && !advancedRDS && !afscreen && !rdsstatscreen) {
      tft.fillRoundRect(248, 36, 69, 18, 2, GreyoutColor);
      tftPrint(ACENTER, "AUTO BW", 282, 38, BackgroundColor, GreyoutColor, 16);
    }
  }
}

