PE5PVB/TEF6686_ESP32/TEF6686_ESP32.ino.cpp
    case TUNE_MI_BAND:
    case TUNE_AUTO:
      tunemode = TUNE_MEM;
      break;

    case TUNE_MEM:
      if (!bandforbidden) tunemode = TUNE_MAN;
      break;
  }
  ShowTuneMode();
  ShowMemoryPos();
  EEPROM.writeByte(EE_BYTE_TUNEMODE, tunemode);
  EEPROM.commit();
}

void ShowTuneMode() {
  if (!screenmute) {
    switch (tunemode) {
      case TUNE_MAN:
        if (band == BAND_SW && nowToggleSWMIBand) {
          tftPrint(ACENTER, "AUTO", 22, 60, GreyoutColor, GreyoutColor, 16);
          tft.fillRoundRect(2, 58, 40, 18, 2, GreyoutColor);
          tftPrint(ACENTER, "BAND", 22, 60, BackgroundColor, GreyoutColor, 16);
        } else {
          tftPrint(ACENTER, "BAND", 22, 60, GreyoutColor, GreyoutColor, 16);
          tft.fillRoundRect(2, 58, 40, 18, 2, GreyoutColor);
          tftPrint(ACENTER, "AUTO", 22, 60, BackgroundColor, GreyoutColor, 16);
        }

        tft.fillRoundRect(2, 36, 40, 18, 2, SecondaryColor);
        tftPrint(ACENTER, "MAN", 22, 38, BackgroundColor, SecondaryColor, 16);

        tft.fillRoundRect(2, 80, 40, 18, 2, GreyoutColor);
        tftPrint(ACENTER, "MEM", 22, 82, BackgroundColor, GreyoutColor, 16);
        break;

      case TUNE_AUTO:
        tft.fillRoundRect(2, 58, 40, 18, 2, SecondaryColor);
        tftPrint(ACENTER, "AUTO", 22, 60, BackgroundColor, SecondaryColor, 16);

        tft.fillRoundRect(2, 36, 40, 18, 2, GreyoutColor);
        tftPrint(ACENTER, "MAN", 22, 38, BackgroundColor, GreyoutColor, 16);

        tft.fillRoundRect(2, 80, 40, 18, 2, GreyoutColor);
        tftPrint(ACENTER, "MEM", 22, 82, BackgroundColor, GreyoutColor, 16);
        break;

      case TUNE_MEM:
        if (band == BAND_SW && nowToggleSWMIBand) {
          tftPrint(ACENTER, "AUTO", 22, 60, GreyoutColor, GreyoutColor, 16);

          tft.fillRoundRect(2, 58, 40, 18, 2, GreyoutColor);
          tftPrint(ACENTER, "BAND", 22, 60, BackgroundColor, GreyoutColor, 16);
        } else {
          tftPrint(ACENTER, "BAND", 22, 60, BackgroundColor, GreyoutColor, 16);

          tft.fillRoundRect(2, 58, 40, 18, 2, GreyoutColor);
          tftPrint(ACENTER, "AUTO", 22, 60, BackgroundColor, GreyoutColor, 16);
        }

        tft.fillRoundRect(2, 36, 40, 18, 2, GreyoutColor);
        tftPrint(ACENTER, "MAN", 22, 38, BackgroundColor, GreyoutColor, 16);

        if (memorystore) {
          tft.fillRoundRect(2, 80, 40, 18, 2, SignificantColor);
          tftPrint(ACENTER, "MEM", 22, 82, BackgroundColor, SignificantColor, 16);
        } else {
          tft.fillRoundRect(2, 80, 40, 18, 2, SecondaryColor);
          tftPrint(ACENTER, "MEM", 22, 82, BackgroundColor, SecondaryColor, 16);
        }
        break;

      case TUNE_MI_BAND:
        tft.fillRoundRect(2, 58, 40, 18, 2, SecondaryColor);
        tftPrint(ACENTER, "BAND", 22, 60, BackgroundColor, SecondaryColor, 16);

        tft.fillRoundRect(2, 36, 40, 18, 2, GreyoutColor);
        tftPrint(ACENTER, "MAN", 22, 38, BackgroundColor, GreyoutColor, 16);

        tft.fillRoundRect(2, 80, 40, 18, 2, GreyoutColor);
        tftPrint(ACENTER, "MEM", 22, 82, BackgroundColor, GreyoutColor, 16);
        break;
    }
  }
}

void ShowRSSI() {
  if (wifi) rssi = WiFi.RSSI(); else rssi = 0;
  if (rssiold != rssi) {
    if (rssiold == 0) tft.drawBitmap(282, 3, WiFiX, 30, 25, BackgroundColor);
    rssiold = rssi;
    if (!wifi && batterydetect) {
      tft.drawBitmap(282, 3, WiFi4, 30, 25, BackgroundColor);
    } else if (rssi == 0) {
      tft.drawBitmap(282, 3, WiFi4, 30, 25, GreyoutColor);
      tft.drawBitmap(282, 3, WiFiX, 30, 25, BarSignificantColor);
    } else if (rssi > -50 && rssi < 0) {
      tft.drawBitmap(282, 3, WiFi4, 30, 25, WifiColorHigh);
    } else if (rssi > -60) {
      tft.drawBitmap(282, 3, WiFi4, 30, 25, GreyoutColor);
      tft.drawBitmap(282, 3, WiFi3, 30, 25, WifiColorHigh);
    } else if (rssi > -70) {
      tft.drawBitmap(282, 3, WiFi4, 30, 25, GreyoutColor);
      tft.drawBitmap(282, 3, WiFi2, 30, 25, WifiColorLow);
    } else {
      tft.drawBitmap(282, 3, WiFi4, 30, 25, GreyoutColor);
      tft.drawBitmap(282, 3, WiFi1, 30, 25, WifiColorLow);
    }
  }
}

void ShowBattery() {
  if (millis() >= batupdatetimer + TIMER_BAT_TIMER) {
    batupdatetimer = millis();
  } else {
    return;
  }

  float v = analogReadMilliVolts(BATTERY_PIN) * 0.002;
  battery = map(constrain(v, BAT_LEVEL_EMPTY, BAT_LEVEL_FULL), BAT_LEVEL_EMPTY, BAT_LEVEL_FULL, 0, BAT_LEVEL_STAGE);
  byte batteryprobe = map(constrain(v, BAT_LEVEL_EMPTY, BAT_LEVEL_FULL), BAT_LEVEL_EMPTY, BAT_LEVEL_FULL, 0, 20);

  if (batteryold != batteryprobe) {
    if (batterydetect) {
      if (battery == 0) {
        tft.drawRoundRect(277, 6, 37, 20, 2, BarSignificantColor);
        tft.fillRoundRect(313, 13, 4, 6, 2, BarSignificantColor);
      } else {
        tft.drawRoundRect(277, 6, 37, 20, 2, ActiveColor);
        tft.fillRoundRect(313, 13, 4, 6, 2, ActiveColor);
      }
      if (batteryoptions != BATTERY_VALUE && batteryoptions != BATTERY_PERCENT && battery != 0) {
        tft.fillRoundRect(279, 8, (battery * 8) , 16, 2, BarInsignificantColor);
      } else {
        tft.fillRoundRect(279, 8, 33, 16, 2, BackgroundColor);
      }
    }
    batteryold = batteryprobe;

    if (batterydetect) {
      float vPer = constrain((v - BATTERY_LOW_VALUE) / (BATTERY_FULL_VALUE - BATTERY_LOW_VALUE), 0.0, 1.0) * 100;

      if (fabs(v - batteryVold) > 0.05 && batteryoptions == BATTERY_VALUE) {
        tftPrint(ALEFT, String(v, 2) + "V", 279, 9, BatteryValueColor, BatteryValueColorSmooth, 16);
        batteryVold = v;
      } else if (int(vPer) != int(vPerold) && batteryoptions == BATTERY_PERCENT && abs(vPer - vPerold) > 0.5) {
        tftPrint(ALEFT, String(vPer, 0) + "%", 279, 9, BatteryValueColor, BatteryValueColorSmooth, 16);
        vPerold = vPer;
      }
    }
  }
  batteryVold = 0;
  vPerold = 0;
}

void DataPrint(String string) {
  if (XDRGTKUSB) Serial.print(string);
  if (XDRGTKTCP) RemoteClient.print(string);
}

void TuneUp() {
  aftest = true;
  aftimer = millis();
  unsigned int temp = 0;
  if (stepsize == 0) {
    if (band > BAND_GAP) {
      if (frequency_AM <= MWHighEdgeSet && frequency_AM >= MWLowEdgeSet) {
        if (!mwstepsize) {
          temp = FREQ_MW_STEP_9K;
          frequency_AM = (frequency_AM / FREQ_MW_STEP_9K) * FREQ_MW_STEP_9K;
        } else if (mwstepsize) {
          temp = FREQ_MW_STEP_10K;
          frequency_AM = (frequency_AM / FREQ_MW_STEP_10K) * FREQ_MW_STEP_10K;
        }
      } else if (frequency_AM < MWLowEdgeSet) {
        temp = FREQ_MW_STEP_9K;
        frequency_AM = (frequency_AM / FREQ_MW_STEP_9K) * FREQ_MW_STEP_9K;
      } else if (frequency_AM <= SWHighEdgeSet && frequency_AM >= SWLowEdgeSet) {
        temp = FREQ_SW_STEP_5K;
        frequency_AM = (frequency_AM / FREQ_SW_STEP_5K) * FREQ_SW_STEP_5K;
      }
#ifdef HAS_AIR_BAND
      else if (frequency_AM < AIRHighEdgeSet && frequency_AM > AIRLowEdgeSet) {

        if (airstepsize == 0) temp = FREQ_AIR_STEP_25K;
        else temp = FREQ_AIR_STEP_8K33;
      }
#endif
    } else {
      if (band == BAND_OIRT) {
        temp = FREQ_OIRT_STEP_30K;
      } else {
        switch (fmdefaultstepsize) {
          case 0: temp = FREQ_FM_STEP_50K; break;
          case 1: temp = FREQ_FM_STEP_100K; break;
          case 2: temp = FREQ_FM_STEP_200K; break;
        }
      }
    }
  }
  if (stepsize == 1) temp = 1;
  else if (stepsize == 2) temp = 10;
  else if (stepsize == 3) temp = 100;
  else if (stepsize == 4) temp = 1000;
  if (rotaryaccelerate && rotarycounter > 2) temp *= 2;

  if (band == BAND_FM) {
    frequency += temp;
    if (scandxmode) {
      while (IsFrequencyUsed(frequency) || presets[memorypos].band != BAND_FM) {
        frequency += temp;
      }
    }

