PE5PVB/TEF6686_ESP32/TEF6686_ESP32.ino.cpp
#ifdef DYNAMIC_SPI_SPEED
  EEPROM.writeByte(EE_BYTE_SPISPEED, 7);
#else
  EEPROM.writeByte(EE_BYTE_SPISPEED, 0);
#endif

#ifdef DEEPELEC_DP_66X
  EEPROM.writeByte(EE_BYTE_ROTARYMODE, 1);
  EEPROM.writeByte(EE_BYTE_INVERTDISPLAY, 0);
  EEPROM.writeByte(EE_BYTE_DISPLAYFLIP, 1);
  EEPROM.writeByte(EE_BYTE_HARDWARE_MODEL, PORTABLE_TOUCH_ILI9341);
#else
  EEPROM.writeByte(EE_BYTE_ROTARYMODE, 0);
  EEPROM.writeByte(EE_BYTE_INVERTDISPLAY, 1);
  EEPROM.writeByte(EE_BYTE_DISPLAYFLIP, 0);
  EEPROM.writeByte(EE_BYTE_HARDWARE_MODEL, BASE_ILI9341);
#endif

  for (int i = 0; i < EE_PRESETS_CNT; i++) {
    EEPROM.writeByte(i + EE_PRESETS_BAND_START, BAND_FM);
    EEPROM.writeUInt((i * 4) + EE_PRESETS_FREQUENCY_START, EE_PRESETS_FREQUENCY);
    EEPROM.writeByte(i + EE_PRESET_BW_START, 0);
    EEPROM.writeByte(i + EE_PRESET_MS_START, 1);

    for (int y = 0; y < 9; y++) {
      EEPROM.writeByte((i * 9) + y + EE_PRESETS_RDSPS_START, '\0');
    }

    for (int y = 0; y < 5; y++) {
      EEPROM.writeByte((i * 5) + y + EE_PRESETS_RDSPI_START, '\0');
    }
  }

  EEPROM.commit();

  handleCreateNewLogbook();
}

void tftReplace(int8_t offset, const String & textold, const String & text, int16_t x, int16_t y, int color, int smoothcolor, int background, uint8_t fontsize) {
  const uint8_t *selectedFont = nullptr;
  if (language == LANGUAGE_CHS) {
    if (fontsize == 16) selectedFont = FONT16_CHS;
    if (fontsize == 28) selectedFont = FONT28_CHS;
  } else {
    if (fontsize == 16) selectedFont = FONT16;
    if (fontsize == 28) selectedFont = FONT28;
  }
  if (fontsize == 48) selectedFont = FONT48;

  tft.loadFont(selectedFont);
  tft.setTextColor(background, background, false);

  switch (offset) {
    case -1: tft.setTextDatum(TL_DATUM); break;
    case 0: tft.setTextDatum(TC_DATUM); break;
    case 1: tft.setTextDatum(TR_DATUM); break;
  }

  tft.drawString(textold, x, y);
  tft.setTextColor(color, smoothcolor, false);

  switch (offset) {
    case -1: tft.setTextDatum(TL_DATUM); break;
    case 0: tft.setTextDatum(TC_DATUM); break;
    case 1: tft.setTextDatum(TR_DATUM); break;
  }

  String modifiedText = text;
  modifiedText.replace("\n", " ");

  tft.drawString(modifiedText, x, y);
  tft.unloadFont();
}

void tftPrint(int8_t offset, const String & text, int16_t x, int16_t y, int color, int smoothcolor, uint8_t fontsize) {
  const uint8_t *selectedFont = nullptr;
  if (language == LANGUAGE_CHS) {
    if (fontsize == 16) selectedFont = FONT16_CHS;
    if (fontsize == 28) selectedFont = FONT28_CHS;
  } else {
    if (fontsize == 16) selectedFont = FONT16;
    if (fontsize == 28) selectedFont = FONT28;
  }

  if (fontsize == 48) selectedFont = FONT48;

  tft.loadFont(selectedFont);

  tft.setTextColor(color, smoothcolor, (fontsize == 52 ? true : false));

  switch (offset) {
    case -1: tft.setTextDatum(TL_DATUM); break;
    case 0: tft.setTextDatum(TC_DATUM); break;
    case 1: tft.setTextDatum(TR_DATUM); break;
  }

  String modifiedText = text;
  modifiedText.replace("\n", " ");

  tft.drawString(modifiedText, x, y, 1);
  tft.unloadFont();
}

void deepSleep() {
  analogWrite(SMETERPIN, 0);
  pinMode (STANDBYLED, OUTPUT);
  digitalWrite(STANDBYLED, LOW);
  MuteScreen(1);
  StoreFrequency();
  radio.power(1);
  esp_sleep_enable_ext0_wakeup(GPIO_NUM_34, LOW);
  esp_deep_sleep_start();
}

void UpdateFonts(byte mode) {
  switch (mode) {
    case 0:
      RDSSprite.unloadFont();
      PSSprite.unloadFont();
      FullLineSprite.unloadFont();
      OneBigLineSprite.unloadFont();

      if (language == LANGUAGE_CHS) {
        RDSSprite.loadFont(FONT16_CHS);
        if (menu) PSSprite.loadFont(FONT16_CHS); else PSSprite.loadFont(FONT28_CHS);
        FullLineSprite.loadFont(FONT16_CHS);
        OneBigLineSprite.loadFont(FONT28_CHS);
      } else {
        RDSSprite.loadFont(FONT16);
        if (menu) PSSprite.loadFont(FONT16); else PSSprite.loadFont(FONT28);
        FullLineSprite.loadFont(FONT16);
        OneBigLineSprite.loadFont(FONT28);
      }
      break;

    case 1:
      FullLineSprite.unloadFont();
      OneBigLineSprite.unloadFont();
      RDSSprite.unloadFont();
      PSSprite.unloadFont();
      break;
  }
}

void cancelDXScan() {
  tunemode = scanmodeold;
  memorypos = memoryposold;
  scandxmode = false;
  if (scanmute) {
    radio.setUnMute();
    tft.drawBitmap(249, 4, Speaker, 28, 24, GreyoutColor);

    if (!flashing) {
      tft.fillRoundRect(2, 80, 40, 18, 2, SecondaryColor);
      tftPrint(ACENTER, "MEM", 22, 82, BackgroundColor, SecondaryColor, 16);
    }

    SQ = false;
    Squelchold = -2;
  }

  ShowTuneMode();
  ShowMemoryPos();
  if (XDRGTKUSB || XDRGTKTCP) DataPrint("J0\n");
}

void endMenu() {
  radio.clearRDS(fullsearchrds);
  menu = false;
  menuopen = false;
  LowLevelInit = true;
  submenu = false;
  menuoption = ITEM1;
  menupage = INDEX;
  menuitem = 0;
  EEPROM.writeByte(EE_BYTE_VOLSET, VolSet);
  EEPROM.writeUInt(EE_UINT16_CONVERTERSET, ConverterSet);
  EEPROM.writeUInt(EE_UINT16_FMLOWEDGESET, LowEdgeSet);
  EEPROM.writeUInt(EE_UINT16_FMHIGHEDGESET, HighEdgeSet);
  EEPROM.writeByte(EE_BYTE_CONTRASTSET, ContrastSet);
  EEPROM.writeByte(EE_BYTE_STEREOLEVEL, StereoLevel);
  EEPROM.writeByte(EE_BYTE_BANDFM, bandFM);
  EEPROM.writeByte(EE_BYTE_BANDAM, bandAM);
  EEPROM.writeByte(EE_BYTE_HIGHCUTLEVEL, HighCutLevel);
  EEPROM.writeByte(EE_BYTE_HIGHCUTOFFSET, HighCutOffset);
  EEPROM.writeByte(EE_BYTE_LEVELOFFSET, LevelOffset);
  EEPROM.writeByte(EE_BYTE_RTBUFFER, radio.rds.rtbuffer);
  EEPROM.writeByte(EE_BYTE_EDGEBEEP, edgebeep);
  EEPROM.writeByte(EE_BYTE_SOFTMUTEAM, softmuteam);
  EEPROM.writeByte(EE_BYTE_SOFTMUTEFM, softmutefm);
  EEPROM.writeByte(EE_BYTE_LANGUAGE, language);
  EEPROM.writeByte(EE_BYTE_SHOWRDSERRORS, showrdserrors);
  EEPROM.writeByte(EE_BYTE_LOWLEVELSET, LowLevelSet);
  EEPROM.writeByte(EE_BYTE_REGION, radio.rds.region);
  EEPROM.writeByte(EE_BYTE_RDS_UNDERSCORE, radio.underscore);
  EEPROM.writeByte(EE_BYTE_USBMODE, USBmode);
  EEPROM.writeByte(EE_BYTE_WIFI, wifi);
  EEPROM.writeByte(EE_BYTE_SUBNETCLIENT, subnetclient);
  EEPROM.writeByte(EE_BYTE_SHOWSWMIBAND, showSWMIBand);
  EEPROM.writeByte(EE_BYTE_RDS_FILTER, radio.rds.filter);
  EEPROM.writeByte(EE_BYTE_RDS_PIERRORS, radio.rds.pierrors);
  EEPROM.writeByte(EE_BYTE_USESQUELCH, usesquelch);
  EEPROM.writeByte(EE_BYTE_SHOWMODULATION, showmodulation);
  EEPROM.writeByte(EE_BYTE_AM_NB, amnb);
  EEPROM.writeByte(EE_BYTE_FM_NB, fmnb);
  EEPROM.writeByte(EE_BYTE_AUDIOMODE, audiomode);
  EEPROM.writeByte(EE_BYTE_TOUCH_ROTATING, touchrotating);
  EEPROM.writeUInt(EE_UINT16_LOWEDGEOIRTSET, LowEdgeOIRTSet);
  EEPROM.writeUInt(EE_UINT16_HIGHEDGEOIRTSET, HighEdgeOIRTSet);
  EEPROM.writeByte(EE_BYTE_HARDWARE_MODEL, hardwaremodel);
  EEPROM.writeByte(EE_BYTE_POWEROPTIONS, poweroptions);
  EEPROM.writeByte(EE_BYTE_CURRENTTHEME, CurrentTheme);
  EEPROM.writeByte(EE_BYTE_FMDEFAULTSTEPSIZE, fmdefaultstepsize);
  EEPROM.writeByte(EE_BYTE_SCREENSAVERSET, screensaverset);
  EEPROM.writeInt(EE_INT16_AMLEVELOFFSET, AMLevelOffset);
  EEPROM.writeByte(EE_BYTE_UNIT, unit);
  EEPROM.writeByte(EE_BYTE_AF, af);
  EEPROM.writeByte(EE_BYTE_STEREO, StereoToggle);
  EEPROM.writeByte(EE_BYTE_BATTERY_OPTIONS, batteryoptions);
  EEPROM.writeByte(EE_BYTE_AM_CO_DECT, amcodect);
  EEPROM.writeByte(EE_BYTE_AM_CO_DECT_COUNT, amcodectcount);
  EEPROM.writeByte(EE_BYTE_AM_RF_GAIN, amgain);
  EEPROM.writeByte(EE_BYTE_SORTAF, radio.rds.sortaf);
  EEPROM.writeByte(EE_BYTE_STATIONLISTID, stationlistid);
  EEPROM.writeByte(EE_BYTE_FM_DEEMPHASIS, fmdeemphasis);
  EEPROM.writeByte(EE_BYTE_FASTPS, radio.rds.fastps);
  EEPROM.writeByte(EE_BYTE_TOT, tot);
  EEPROM.writeByte(EE_BYTE_MWREGION, mwstepsize);
#ifdef HAS_AIR_BAND
  EEPROM.writeByte(EE_BYTE_AIRSTEPSIZE, airstepsize);
#endif
  EEPROM.writeByte(EE_BYTE_SPISPEED, spispeed);
  EEPROM.writeByte(EE_BYTE_AMSCANSENS, amscansens);
  EEPROM.writeByte(EE_BYTE_FMSCANSENS, fmscansens);
  EEPROM.writeByte(EE_BYTE_FREQFONT, freqfont);
  EEPROM.writeByte(EE_BYTE_SKIN, CurrentSkin);
  EEPROM.writeByte(EE_BYTE_XDRGTKMUTE, XDRGTKMuteScreen);
  EEPROM.writeByte(EE_BYTE_FMAGC, fmagc);
  EEPROM.writeByte(EE_BYTE_AMAGC, amagc);
  EEPROM.writeByte(EE_BYTE_FMSI, fmsi);
  EEPROM.writeByte(EE_BYTE_SCANSTART, scanstart);
  EEPROM.writeByte(EE_BYTE_SCANSTOP, scanstop);
  EEPROM.writeByte(EE_BYTE_SCANHOLD, scanhold);
  EEPROM.writeByte(EE_BYTE_SCANMEM, scanmem);
  EEPROM.writeByte(EE_BYTE_SCANCANCEL, scancancel);
  EEPROM.writeByte(EE_BYTE_SCANMUTE, scanmute);
  EEPROM.writeByte(EE_BYTE_AUTOSQUELCH, autosquelch);
  EEPROM.writeByte(EE_BYTE_LONGBANDPRESS, longbandpress);
  EEPROM.writeByte(EE_BYTE_SHOWCLOCK, showclock);
  EEPROM.writeByte(EE_BYTE_SHOWLONGPS, showlongps);
  EEPROM.writeUInt(EE_UINT16_MEMSTARTFREQ, memstartfreq);
  EEPROM.writeUInt(EE_UINT16_MEMSTOPFREQ, memstopfreq);
  EEPROM.writeByte(EE_BYTE_MEMSTARTPOS, memstartpos);
  EEPROM.writeByte(EE_BYTE_MEMSTOPPOS, memstoppos);
  EEPROM.writeByte(EE_BYTE_MEMPIONLY, mempionly);
  EEPROM.writeByte(EE_BYTE_MEMDOUBLEPI, memdoublepi);
  EEPROM.writeByte(EE_BYTE_WAITONLYONSIGNAL, scanholdonsignal);
  EEPROM.writeByte(EE_BYTE_NTPOFFSET, NTPoffset);
  EEPROM.writeByte(EE_BYTE_AUTOLOG, autolog);
  EEPROM.writeByte(EE_BYTE_AUTODST, autoDST);
  EEPROM.writeByte(EE_BYTE_CLOCKAMPM, clockampm);
  EEPROM.writeUInt(EE_UINT16_PICTLOCK, radio.rds.PICTlock);
  EEPROM.commit();
  if (af == 2) radio.rds.afreg = true; else radio.rds.afreg = false;
  Serial.end();
  if (wifi) remoteip = IPAddress (WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], subnetclient);
  if (USBmode) Serial.begin(19200); else Serial.begin(115200);

