PE5PVB/TEF6686_ESP32/TEF6686_ESP32.ino.cpp
    if (percent != percentold) {
      switch (CurrentTheme) {
        case 7:
          SignalSprite.pushImage(-107, -95, 292, 170, popupbackground_wo);
          SquelchSprite.pushImage(-177, -135, 292, 170, popupbackground_wo);
          break;

        default:
          SignalSprite.pushImage(-107, -95, 292, 170, popupbackground);
          SquelchSprite.pushImage(-177, -135, 292, 170, popupbackground);
          break;
      }

      SignalSprite.setTextColor(SecondaryColor, SecondaryColorSmooth, false);
      SignalSprite.setTextDatum(TC_DATUM);
      SignalSprite.loadFont(FONT28);
      SignalSprite.drawString(String(percent) + "%", 40, 0);
      SignalSprite.unloadFont();
      SignalSprite.pushSprite(120, 125);

      if (language == LANGUAGE_CHS) SquelchSprite.loadFont(FONT16_CHS); else SquelchSprite.loadFont(FONT16);
      SquelchSprite.setTextColor(PrimaryColor, PrimaryColorSmooth, false);
      SquelchSprite.drawString(String(counter), 0, 0);
      SquelchSprite.pushSprite(200, 155);

      tft.fillRect(60, 110, 2 * percent, 6, BarInsignificantColor);

      percentold = percent;
    }
    if (digitalRead(MODEBUTTON) == LOW) {
      while (digitalRead(MODEBUTTON)) delay(50);
      error = 2;
      stopScanning = true;
      break;
    }
  }

  frequency = _current;
  radio.SetFreq(frequency);
  radio.clearRDS(fullsearchrds);
  radio.setUnMute();
  SQ = false;

  return error;
}

void doBandToggle() {
  if (tunemode != TUNE_MEM) {
    ToggleBand(band);
    radio.clearRDS(fullsearchrds);
    StoreFrequency();
    SelectBand();
    if (XDRGTKUSB || XDRGTKTCP) {
      if (band == BAND_FM) DataPrint("M0\nT" + String(frequency * 10) + "\n");
      else if (band == BAND_OIRT) DataPrint("M0\nT" + String(frequency_OIRT * 10) + "\n");
      else DataPrint("M1\nT" + String(frequency_AM) + "\n");
    }
  } else {
    scanmodeold = tunemode;
    startFMDXScan();
    return;
  }
  screensavertimer = millis();
}

void StoreMemoryPos(uint8_t _pos) {
  EEPROM.writeByte(_pos + EE_PRESETS_BAND_START, band);
  EEPROM.writeByte(_pos + EE_PRESET_BW_START, BWset);
  EEPROM.writeByte(_pos + EE_PRESET_MS_START, StereoToggle);
  if (band == BAND_FM) {
    EEPROM.writeUInt((_pos * 4) + EE_PRESETS_FREQUENCY_START, frequency);
  } else if (band == BAND_OIRT) {
    EEPROM.writeUInt((_pos * 4) + EE_PRESETS_FREQUENCY_START, frequency_OIRT);
  } else if (band == BAND_LW) {
    EEPROM.writeUInt((_pos * 4) + EE_PRESETS_FREQUENCY_START, frequency_LW);
  } else if (band == BAND_MW) {
    EEPROM.writeUInt((_pos * 4) + EE_PRESETS_FREQUENCY_START, frequency_MW);
  } else {
    EEPROM.writeUInt((_pos * 4) + EE_PRESETS_FREQUENCY_START, frequency_SW);
  }

  presets[_pos].band = band;
  presets[_pos].bw = BWset;
  presets[_pos].ms = StereoToggle;

  String stationName = radio.rds.stationName;
  char stationNameCharArray[10];
  char picodeArray[7];
  stationName.toCharArray(stationNameCharArray, sizeof(stationNameCharArray));
  memcpy(picodeArray, radio.rds.picode, sizeof(picodeArray));

  for (int y = 0; y < 9; y++) {
    presets[_pos].RDSPS[y] = (y < strlen(stationNameCharArray)) ? stationNameCharArray[y] : '\0';
    EEPROM.writeByte((_pos * 9) + y + EE_PRESETS_RDSPS_START, presets[_pos].RDSPS[y]);
  }

  for (int y = 0; y < 5; y++) {
    presets[_pos].RDSPI[y] = (y < sizeof(picodeArray)) ? picodeArray[y] : '\0';
    EEPROM.writeByte((_pos * 5) + y + EE_PRESETS_RDSPI_START, presets[_pos].RDSPI[y]);
  }

  EEPROM.commit();

  if (band == BAND_FM) {
    presets[_pos].frequency = frequency;
  } else if (band == BAND_OIRT) {
    presets[_pos].frequency = frequency_OIRT;
  } else if (band == BAND_LW) {
    presets[_pos].frequency = frequency_LW;
  } else if (band == BAND_MW) {
    presets[_pos].frequency = frequency_MW;
  } else {
    presets[_pos].frequency = frequency_SW;
  }
}

void ClearMemoryRange(uint8_t start, uint8_t stop) {
  for (uint8_t pos = start; pos <= stop; pos++) {
    EEPROM.writeByte(pos + EE_PRESETS_BAND_START, BAND_FM);
    EEPROM.writeUInt((pos * 4) + EE_PRESETS_FREQUENCY_START, EE_PRESETS_FREQUENCY);
    EEPROM.writeByte(pos + EE_PRESET_BW_START, 0);
    EEPROM.writeByte(pos + EE_PRESET_MS_START, 1);

    for (int y = 0; y < 9; y++) {
      EEPROM.writeByte((pos * 9) + y + EE_PRESETS_RDSPS_START, '\0');
      presets[pos].RDSPS[y] = '\0';
    }

    for (int y = 0; y < 5; y++) {
      EEPROM.writeByte((pos * 5) + y + EE_PRESETS_RDSPI_START, '\0');
      presets[pos].RDSPI[y] = '\0';
    }

    EEPROM.commit();
    presets[pos].band = BAND_FM;
    presets[pos].frequency = EE_PRESETS_FREQUENCY;
  }
}

void Touch_IRQ_Handler() {
  touch_detect = true;
}

byte numval[16] = {
  2, 3, 127, 5, 6, 0, 9, 13, 8, 7, 4, 1, 0, 0, 0, 0
};

int GetNum(void) {
  int16_t temp;
  int cnt = 0;
  unsigned int num;
  static int heldNum = -1;

  Wire.beginTransmission(0x20);
  Wire.write(0x00);
  Wire.endTransmission();
  Wire.requestFrom(0x20, 2);

  if (Wire.available() == 2) {
    keypadtimer = millis();
    temp = Wire.read() & 0xFF;
    temp |= (Wire.read() & 0xFF) * 256;
    for (int i = 0; i < 16; i++) {
      if (i != 2 && (temp & 0x01) == 0) {
        num = numval[i];
        cnt ++;
      }
      temp >>= 1;
    }
    if (cnt == 1) {
      if (heldNum == -1) {
        heldNum = num;
        return num;
      }
    } else if (cnt == 0) {
      heldNum = -1;
    }
  }

  return -1;
}

void ShowNum(int val) {
  switch (freqfont) {
    case 1: FrequencySprite.loadFont(FREQFONT1); break;
    case 2: FrequencySprite.loadFont(FREQFONT2); break;
    case 3: FrequencySprite.loadFont(FREQFONT3); break;
    case 4: FrequencySprite.loadFont(FREQFONT4); break;
    default: FrequencySprite.loadFont(FREQFONT0); break;
  }

  FrequencySprite.setTextDatum(TR_DATUM);

  FrequencySprite.fillSprite(BackgroundColor);
  FrequencySprite.setTextColor(SecondaryColor, SecondaryColorSmooth, false);
  FrequencySprite.drawString(String(val) + " ", 218, -6);
  FrequencySprite.pushSprite(46, 46);

  FrequencySprite.unloadFont();
}

bool TuneFreq(int temp) {
  aftest = true;
  aftimer = millis();
  bool accepted = true;

  if (band == BAND_FM) {
    while (temp < (LowEdgeSet * 10)) temp = temp * 10;
    if (temp > (HighEdgeSet * 10)) {
      if (edgebeep) EdgeBeeper();
      accepted = false;
    } else {
      frequency = temp;
    }
    radio.SetFreq(frequency);
  } else if (band == BAND_OIRT) {
    while (temp < LowEdgeOIRTSet) temp = temp * 10;
    if (temp > HighEdgeOIRTSet) {
      if (edgebeep) EdgeBeeper();
      accepted = false;
    } else {
      frequency_OIRT = temp;
    }
    radio.SetFreq(frequency_OIRT);
  } else if (band == BAND_LW) {
    while (temp < LWLowEdgeSet) temp = temp * 10;
    if (temp > LWHighEdgeSet) {
      if (edgebeep) EdgeBeeper();
      accepted = false;
    } else {
      frequency_AM = temp;
    }
    radio.SetFreqAM(frequency_AM);
    frequency_LW = frequency_AM;
  } else if (band == BAND_MW) {
    while (temp < MWLowEdgeSet) temp = temp * 10;
    if (temp > MWHighEdgeSet) {
      if (edgebeep) EdgeBeeper();
      accepted = false;
    } else {
      frequency_AM = temp;
    }
    radio.SetFreqAM(frequency_AM);
    frequency_MW = frequency_AM;
  } else if (band == BAND_SW) {
    while (temp < SWLowEdgeSet) temp = temp * 10;
    if (temp > SWHighEdgeSet) {
      if (edgebeep) EdgeBeeper();
      accepted = false;
    } else {
      frequency_AM = temp;
    }
    radio.SetFreqAM(frequency_AM);
    frequency_SW = frequency_AM;
  }

  radio.clearRDS(fullsearchrds);
  if (RDSSPYUSB) Serial.print("G:\r\nRESET-------\r\n\r\n");
  if (RDSSPYTCP) RemoteClient.print("G:\r\nRESET-------\r\n\r\n");
  return accepted;
}

void NumpadProcess(int num) {
  if (scandxmode) {
    if (num == 127) {
      ShowFreq(5);
      ShowFreq(0);
    }
  } else if (tunemode == TUNE_MEM) {
    if (num == 127) {
      freq_in = 0;
      menuoption = ITEM1;
      menupage = DXMODE;
      menuitem = 0;
#ifdef DYNAMIC_SPI_SPEED
      if (spispeed == 7) tft.setSPISpeed(40);
#endif
      submenu = true;
      menu = true;
      PSSprite.unloadFont();
      if (language == LANGUAGE_CHS) PSSprite.loadFont(FONT16_CHS); else PSSprite.loadFont(FONT16);
      BuildMenu();
    } else if (num == 13) {
      if (freq_in > 0 && freq_in <= EE_PRESETS_CNT) {
        byte oldmemorypos = memorypos;
        memorypos = freq_in - 1;
        if (memorystore) {
          memorystore = false;
          StoreMemoryPos(memorypos);
          ShowTuneMode();
          if (memoryposstatus == MEM_DARK || memoryposstatus == MEM_EXIST) memoryposstatus = MEM_NORMAL;
          ShowFreq(0);
          ShowMemoryPos();
        } else if (IsStationEmpty()) {

          switch (freqfont) {
            case 1: FrequencySprite.loadFont(FREQFONT1); break;
            case 2: FrequencySprite.loadFont(FREQFONT2); break;
            case 3: FrequencySprite.loadFont(FREQFONT3); break;
            case 4: FrequencySprite.loadFont(FREQFONT4); break;
            default: FrequencySprite.loadFont(FREQFONT0); break;
          }
          FrequencySprite.setTextDatum(TR_DATUM);
          FrequencySprite.fillSprite(BackgroundColor);
          FrequencySprite.setTextColor(SignificantColor, SignificantColorSmooth, false);
          FrequencySprite.drawString(String(freq_in) + " ", 218, -6);
          FrequencySprite.pushSprite(46, 46);
          FrequencySprite.unloadFont();
          delay(500);
          memorypos = oldmemorypos;
          ShowFreq(0);
          ShowMemoryPos();
        } else {
          DoMemoryPosTune();
          ShowMemoryPos();
        }
      } else {
        ShowFreq(0);
      }
      freq_in = 0;
    } else {
      if (freq_in / 100 == 0) {
        int temp = freq_in * 10 + num;
        if (temp <= EE_PRESETS_CNT) freq_in = temp;
      }
      ShowNum(freq_in);
    }
  } else {
    if (num == 127) {
      freq_in = 0;
      menuoption = ITEM1;
      menupage = DXMODE;
      menuitem = 0;
#ifdef DYNAMIC_SPI_SPEED
      if (spispeed == 7) tft.setSPISpeed(40);
#endif
      submenu = true;
      menu = true;
      PSSprite.unloadFont();
      if (language == LANGUAGE_CHS) PSSprite.loadFont(FONT16_CHS); else PSSprite.loadFont(FONT16);
      BuildMenu();
    } else if (num == 13) {
      if (freq_in != 0) {
        if (TuneFreq(freq_in)) {
          if (XDRGTKUSB || XDRGTKTCP) {
            if (band == BAND_FM) DataPrint("M0\nT" + String(frequency * 10) + "\n"); else if (band == BAND_OIRT) DataPrint("M0\nT" + String(frequency_OIRT * 10) + "\n"); else DataPrint("M1\nT" + String(frequency_AM) + "\n");
          }
          if (!memorystore) {
            if (!memtune) radio.clearRDS(fullsearchrds);
            memtune = false;
            ShowFreq(0);
            store = true;
          }
        } else {
          ShowNum(freq_in);
          FrequencySprite.loadFont(freqfont == 1 ? FREQFONT1 : freqfont == 2 ? FREQFONT2 : freqfont == 3 ? FREQFONT3 : freqfont == 4 ? FREQFONT4 : FREQFONT0);
          FrequencySprite.setTextDatum(TR_DATUM);
          FrequencySprite.fillSprite(BackgroundColor);
          FrequencySprite.setTextColor(SignificantColor, SignificantColorSmooth, false);
          FrequencySprite.drawString(String(freq_in) + " ", 218, -6);
          FrequencySprite.pushSprite(46, 46);
          FrequencySprite.unloadFont();
          delay(1000);
          ShowFreq(0);
        }
      } else {
        ShowFreq(0);
      }
      freq_in = 0;
    } else {
      if (freq_in / 10000 == 0) {
        freq_in = freq_in * 10 + num;
      }
      ShowNum(freq_in);
    }
  }
}

